/* automatically generated by rust-bindgen */

extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13version_majorE"]
    pub static GiNaC_version_major: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13version_minorE"]
    pub static GiNaC_version_minor: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13version_microE"]
    pub static GiNaC_version_micro: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_expand_options {
    pub _address: u8,
}
pub const GiNaC_expand_options_expand_indexed:
    GiNaC_expand_options__bindgen_ty_1 = 1;
pub const GiNaC_expand_options_expand_function_args:
    GiNaC_expand_options__bindgen_ty_1 = 2;
pub const GiNaC_expand_options_expand_rename_idx:
    GiNaC_expand_options__bindgen_ty_1 = 4;
pub const GiNaC_expand_options_expand_transcendental:
    GiNaC_expand_options__bindgen_ty_1 = 8;
pub type GiNaC_expand_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_expand_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_expand_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_expand_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_expand_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_expand_options))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_has_options {
    pub _address: u8,
}
pub const GiNaC_has_options_algebraic: GiNaC_has_options__bindgen_ty_1 = 1;
pub type GiNaC_has_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_has_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_has_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_has_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_has_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_has_options))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_subs_options {
    pub _address: u8,
}
pub const GiNaC_subs_options_no_pattern: GiNaC_subs_options__bindgen_ty_1 = 1;
pub const GiNaC_subs_options_subs_no_pattern: GiNaC_subs_options__bindgen_ty_1 =
    1;
pub const GiNaC_subs_options_algebraic: GiNaC_subs_options__bindgen_ty_1 = 2;
pub const GiNaC_subs_options_subs_algebraic: GiNaC_subs_options__bindgen_ty_1 =
    2;
pub const GiNaC_subs_options_pattern_is_product:
    GiNaC_subs_options__bindgen_ty_1 = 4;
pub const GiNaC_subs_options_pattern_is_not_product:
    GiNaC_subs_options__bindgen_ty_1 = 8;
pub const GiNaC_subs_options_no_index_renaming:
    GiNaC_subs_options__bindgen_ty_1 = 16;
pub const GiNaC_subs_options_really_subs_idx: GiNaC_subs_options__bindgen_ty_1 =
    32;
pub type GiNaC_subs_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_subs_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_subs_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_subs_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_subs_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_subs_options))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_domain {
    pub _address: u8,
}
pub const GiNaC_domain_complex: GiNaC_domain__bindgen_ty_1 = 0;
pub const GiNaC_domain_real: GiNaC_domain__bindgen_ty_1 = 1;
pub const GiNaC_domain_positive: GiNaC_domain__bindgen_ty_1 = 2;
pub type GiNaC_domain__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_domain() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_domain>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_domain))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_domain>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_domain))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_series_options {
    pub _address: u8,
}
pub const GiNaC_series_options_suppress_branchcut:
    GiNaC_series_options__bindgen_ty_1 = 1;
pub type GiNaC_series_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_series_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_series_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_series_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_series_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_series_options))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_determinant_algo {
    pub _address: u8,
}
pub const GiNaC_determinant_algo_automatic:
    GiNaC_determinant_algo__bindgen_ty_1 = 0;
pub const GiNaC_determinant_algo_gauss: GiNaC_determinant_algo__bindgen_ty_1 =
    1;
pub const GiNaC_determinant_algo_divfree: GiNaC_determinant_algo__bindgen_ty_1 =
    2;
pub const GiNaC_determinant_algo_laplace: GiNaC_determinant_algo__bindgen_ty_1 =
    3;
pub const GiNaC_determinant_algo_bareiss: GiNaC_determinant_algo__bindgen_ty_1 =
    4;
pub type GiNaC_determinant_algo__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_determinant_algo() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_determinant_algo>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_determinant_algo))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_determinant_algo>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_determinant_algo))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_solve_algo {
    pub _address: u8,
}
pub const GiNaC_solve_algo_automatic: GiNaC_solve_algo__bindgen_ty_1 = 0;
pub const GiNaC_solve_algo_gauss: GiNaC_solve_algo__bindgen_ty_1 = 1;
pub const GiNaC_solve_algo_divfree: GiNaC_solve_algo__bindgen_ty_1 = 2;
pub const GiNaC_solve_algo_bareiss: GiNaC_solve_algo__bindgen_ty_1 = 3;
pub const GiNaC_solve_algo_markowitz: GiNaC_solve_algo__bindgen_ty_1 = 4;
pub type GiNaC_solve_algo__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_solve_algo() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_solve_algo>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_solve_algo))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_solve_algo>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_solve_algo))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_status_flags {
    pub _address: u8,
}
pub const GiNaC_status_flags_dynallocated: GiNaC_status_flags__bindgen_ty_1 = 1;
pub const GiNaC_status_flags_evaluated: GiNaC_status_flags__bindgen_ty_1 = 2;
pub const GiNaC_status_flags_expanded: GiNaC_status_flags__bindgen_ty_1 = 4;
pub const GiNaC_status_flags_hash_calculated: GiNaC_status_flags__bindgen_ty_1 =
    8;
pub const GiNaC_status_flags_not_shareable: GiNaC_status_flags__bindgen_ty_1 =
    16;
pub const GiNaC_status_flags_has_indices: GiNaC_status_flags__bindgen_ty_1 = 32;
pub const GiNaC_status_flags_has_no_indices: GiNaC_status_flags__bindgen_ty_1 =
    64;
pub const GiNaC_status_flags_is_positive: GiNaC_status_flags__bindgen_ty_1 =
    128;
pub const GiNaC_status_flags_is_negative: GiNaC_status_flags__bindgen_ty_1 =
    256;
pub const GiNaC_status_flags_purely_indefinite:
    GiNaC_status_flags__bindgen_ty_1 = 512;
pub type GiNaC_status_flags__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_status_flags() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_status_flags>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_status_flags))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_status_flags>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_status_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_info_flags {
    pub _address: u8,
}
pub const GiNaC_info_flags_numeric: GiNaC_info_flags__bindgen_ty_1 = 0;
pub const GiNaC_info_flags_real: GiNaC_info_flags__bindgen_ty_1 = 1;
pub const GiNaC_info_flags_rational: GiNaC_info_flags__bindgen_ty_1 = 2;
pub const GiNaC_info_flags_integer: GiNaC_info_flags__bindgen_ty_1 = 3;
pub const GiNaC_info_flags_crational: GiNaC_info_flags__bindgen_ty_1 = 4;
pub const GiNaC_info_flags_cinteger: GiNaC_info_flags__bindgen_ty_1 = 5;
pub const GiNaC_info_flags_positive: GiNaC_info_flags__bindgen_ty_1 = 6;
pub const GiNaC_info_flags_negative: GiNaC_info_flags__bindgen_ty_1 = 7;
pub const GiNaC_info_flags_nonnegative: GiNaC_info_flags__bindgen_ty_1 = 8;
pub const GiNaC_info_flags_posint: GiNaC_info_flags__bindgen_ty_1 = 9;
pub const GiNaC_info_flags_negint: GiNaC_info_flags__bindgen_ty_1 = 10;
pub const GiNaC_info_flags_nonnegint: GiNaC_info_flags__bindgen_ty_1 = 11;
pub const GiNaC_info_flags_even: GiNaC_info_flags__bindgen_ty_1 = 12;
pub const GiNaC_info_flags_odd: GiNaC_info_flags__bindgen_ty_1 = 13;
pub const GiNaC_info_flags_prime: GiNaC_info_flags__bindgen_ty_1 = 14;
pub const GiNaC_info_flags_relation: GiNaC_info_flags__bindgen_ty_1 = 15;
pub const GiNaC_info_flags_relation_equal: GiNaC_info_flags__bindgen_ty_1 = 16;
pub const GiNaC_info_flags_relation_not_equal: GiNaC_info_flags__bindgen_ty_1 =
    17;
pub const GiNaC_info_flags_relation_less: GiNaC_info_flags__bindgen_ty_1 = 18;
pub const GiNaC_info_flags_relation_less_or_equal:
    GiNaC_info_flags__bindgen_ty_1 = 19;
pub const GiNaC_info_flags_relation_greater: GiNaC_info_flags__bindgen_ty_1 =
    20;
pub const GiNaC_info_flags_relation_greater_or_equal:
    GiNaC_info_flags__bindgen_ty_1 = 21;
pub const GiNaC_info_flags_symbol: GiNaC_info_flags__bindgen_ty_1 = 22;
pub const GiNaC_info_flags_list: GiNaC_info_flags__bindgen_ty_1 = 23;
pub const GiNaC_info_flags_exprseq: GiNaC_info_flags__bindgen_ty_1 = 24;
pub const GiNaC_info_flags_polynomial: GiNaC_info_flags__bindgen_ty_1 = 25;
pub const GiNaC_info_flags_integer_polynomial: GiNaC_info_flags__bindgen_ty_1 =
    26;
pub const GiNaC_info_flags_cinteger_polynomial: GiNaC_info_flags__bindgen_ty_1 =
    27;
pub const GiNaC_info_flags_rational_polynomial: GiNaC_info_flags__bindgen_ty_1 =
    28;
pub const GiNaC_info_flags_crational_polynomial:
    GiNaC_info_flags__bindgen_ty_1 = 29;
pub const GiNaC_info_flags_rational_function: GiNaC_info_flags__bindgen_ty_1 =
    30;
pub const GiNaC_info_flags_indexed: GiNaC_info_flags__bindgen_ty_1 = 31;
pub const GiNaC_info_flags_has_indices: GiNaC_info_flags__bindgen_ty_1 = 32;
pub const GiNaC_info_flags_idx: GiNaC_info_flags__bindgen_ty_1 = 33;
pub const GiNaC_info_flags_expanded: GiNaC_info_flags__bindgen_ty_1 = 34;
pub const GiNaC_info_flags_indefinite: GiNaC_info_flags__bindgen_ty_1 = 35;
pub type GiNaC_info_flags__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_info_flags() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_info_flags>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_info_flags))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_info_flags>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_info_flags))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_return_types {
    pub _address: u8,
}
pub const GiNaC_return_types_commutative: GiNaC_return_types__bindgen_ty_1 = 0;
pub const GiNaC_return_types_noncommutative: GiNaC_return_types__bindgen_ty_1 =
    1;
pub const GiNaC_return_types_noncommutative_composite:
    GiNaC_return_types__bindgen_ty_1 = 2;
pub type GiNaC_return_types__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_return_types() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_return_types>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_return_types))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_return_types>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_return_types))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_remember_strategies {
    pub _address: u8,
}
pub const GiNaC_remember_strategies_delete_never:
    GiNaC_remember_strategies__bindgen_ty_1 = 0;
pub const GiNaC_remember_strategies_delete_lru:
    GiNaC_remember_strategies__bindgen_ty_1 = 1;
pub const GiNaC_remember_strategies_delete_lfu:
    GiNaC_remember_strategies__bindgen_ty_1 = 2;
pub const GiNaC_remember_strategies_delete_cyclic:
    GiNaC_remember_strategies__bindgen_ty_1 = 3;
pub type GiNaC_remember_strategies__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_remember_strategies() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_remember_strategies>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_remember_strategies))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_remember_strategies>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_remember_strategies))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_factor_options {
    pub _address: u8,
}
pub const GiNaC_factor_options_polynomial: GiNaC_factor_options__bindgen_ty_1 =
    0;
pub const GiNaC_factor_options_all: GiNaC_factor_options__bindgen_ty_1 = 1;
pub type GiNaC_factor_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_factor_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_factor_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_factor_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_factor_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_factor_options))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_refcounted {
    pub refcount: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GiNaC_refcounted() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_refcounted>(),
        4usize,
        concat!("Size of: ", stringify!(GiNaC_refcounted))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_refcounted>(),
        4usize,
        concat!("Alignment of ", stringify!(GiNaC_refcounted))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_refcounted>())).refcount as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_refcounted),
            "::",
            stringify!(refcount)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_ptr<T> {
    pub p: *mut T,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_class_info<OPT> {
    pub options: OPT,
    pub next: *mut GiNaC_class_info<OPT>,
    pub parent: *mut GiNaC_class_info<OPT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<OPT>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_class_info_tree_node<OPT> {
    pub children: u8,
    pub info: *mut GiNaC_class_info<OPT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<OPT>>,
}
extern "C" {
}
extern "C" {
    #[link_name = "\u{1}parents_identified"]
    pub static mut GiNaC_parents_identified: bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_print_context_options {
    pub name: *const ::std::os::raw::c_char,
    pub parent_name: *const ::std::os::raw::c_char,
    pub id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GiNaC_print_context_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_context_options>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_context_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_context_options>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_context_options))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_context_options>())).name
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_context_options),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_context_options>())).parent_name
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_context_options),
            "::",
            stringify!(parent_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_context_options>())).id
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_context_options),
            "::",
            stringify!(id)
        )
    );
}
pub type GiNaC_print_context_class_info =
    GiNaC_class_info<GiNaC_print_context_options>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_print_options {
    pub _address: u8,
}
pub const GiNaC_print_options_print_index_dimensions:
    GiNaC_print_options__bindgen_ty_1 = 1;
pub type GiNaC_print_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_print_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_print_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_print_options))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21next_print_context_idE"]
    pub static mut GiNaC_next_print_context_id: ::std::os::raw::c_uint;
}
#[repr(C)]
pub struct GiNaC_print_context__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_context {
    pub vtable_: *const GiNaC_print_context__bindgen_vtable,
    pub s: *mut std_ostream,
    pub options: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GiNaC_print_context() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_context>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_context))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_context>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_context))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_context>())).s as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_context),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_context>())).options as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_context),
            "::",
            stringify!(options)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13print_context21get_class_info_staticEv"]
    pub fn GiNaC_print_context_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13print_contextC1Ev"]
    pub fn GiNaC_print_context_print_context(this: *mut GiNaC_print_context);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13print_contextC1ERSoj"]
    pub fn GiNaC_print_context_print_context1(
        this: *mut GiNaC_print_context,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_context {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_context_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_context_print_context(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_context_print_context1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_dflt {
    pub _base: GiNaC_print_context,
}
pub type GiNaC_print_dflt_inherited = GiNaC_print_context;
#[test]
fn bindgen_test_layout_GiNaC_print_dflt() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_dflt>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_dflt))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_dflt>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_dflt))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_dflt21get_class_info_staticEv"]
    pub fn GiNaC_print_dflt_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_dfltC1Ev"]
    pub fn GiNaC_print_dflt_print_dflt(this: *mut GiNaC_print_dflt);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_dfltC1ERSoj"]
    pub fn GiNaC_print_dflt_print_dflt1(
        this: *mut GiNaC_print_dflt,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_dflt {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_dflt_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_dflt_print_dflt(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_dflt_print_dflt1(__bindgen_tmp.as_mut_ptr(), arg1, options);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_latex {
    pub _base: GiNaC_print_context,
}
pub type GiNaC_print_latex_inherited = GiNaC_print_context;
#[test]
fn bindgen_test_layout_GiNaC_print_latex() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_latex>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_latex))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_latex>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_latex))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11print_latex21get_class_info_staticEv"]
    pub fn GiNaC_print_latex_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11print_latexC1Ev"]
    pub fn GiNaC_print_latex_print_latex(this: *mut GiNaC_print_latex);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11print_latexC1ERSoj"]
    pub fn GiNaC_print_latex_print_latex1(
        this: *mut GiNaC_print_latex,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_latex {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_latex_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_latex_print_latex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_latex_print_latex1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_python {
    pub _base: GiNaC_print_context,
}
pub type GiNaC_print_python_inherited = GiNaC_print_context;
#[test]
fn bindgen_test_layout_GiNaC_print_python() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_python>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_python))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_python>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_python))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12print_python21get_class_info_staticEv"]
    pub fn GiNaC_print_python_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12print_pythonC1Ev"]
    pub fn GiNaC_print_python_print_python(this: *mut GiNaC_print_python);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12print_pythonC1ERSoj"]
    pub fn GiNaC_print_python_print_python1(
        this: *mut GiNaC_print_python,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_python {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_python_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_python_print_python(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_python_print_python1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_python_repr {
    pub _base: GiNaC_print_context,
}
pub type GiNaC_print_python_repr_inherited = GiNaC_print_context;
#[test]
fn bindgen_test_layout_GiNaC_print_python_repr() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_python_repr>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_python_repr))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_python_repr>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_python_repr))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17print_python_repr21get_class_info_staticEv"]
    pub fn GiNaC_print_python_repr_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17print_python_reprC1Ev"]
    pub fn GiNaC_print_python_repr_print_python_repr(
        this: *mut GiNaC_print_python_repr,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17print_python_reprC1ERSoj"]
    pub fn GiNaC_print_python_repr_print_python_repr1(
        this: *mut GiNaC_print_python_repr,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_python_repr {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_python_repr_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_python_repr_print_python_repr(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_python_repr_print_python_repr1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_tree {
    pub _base: GiNaC_print_context,
    pub delta_indent: ::std::os::raw::c_uint,
}
pub type GiNaC_print_tree_inherited = GiNaC_print_context;
#[test]
fn bindgen_test_layout_GiNaC_print_tree() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_tree>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_tree))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_tree>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_tree))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_tree>())).delta_indent
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_tree),
            "::",
            stringify!(delta_indent)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_tree21get_class_info_staticEv"]
    pub fn GiNaC_print_tree_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_treeC1Ev"]
    pub fn GiNaC_print_tree_print_tree(this: *mut GiNaC_print_tree);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_treeC1Ej"]
    pub fn GiNaC_print_tree_print_tree1(
        this: *mut GiNaC_print_tree,
        d: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_treeC1ERSojj"]
    pub fn GiNaC_print_tree_print_tree2(
        this: *mut GiNaC_print_tree,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
        d: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_tree {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_tree_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_tree_print_tree(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(d: ::std::os::raw::c_uint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_tree_print_tree1(__bindgen_tmp.as_mut_ptr(), d);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
        d: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_tree_print_tree2(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
            d,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_csrc {
    pub _base: GiNaC_print_context,
}
pub type GiNaC_print_csrc_inherited = GiNaC_print_context;
#[test]
fn bindgen_test_layout_GiNaC_print_csrc() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_csrc>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_csrc))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_csrc>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_csrc))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_csrc21get_class_info_staticEv"]
    pub fn GiNaC_print_csrc_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_csrcC1Ev"]
    pub fn GiNaC_print_csrc_print_csrc(this: *mut GiNaC_print_csrc);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10print_csrcC1ERSoj"]
    pub fn GiNaC_print_csrc_print_csrc1(
        this: *mut GiNaC_print_csrc,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_csrc {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_csrc_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_print_csrc(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_print_csrc1(__bindgen_tmp.as_mut_ptr(), arg1, options);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_csrc_float {
    pub _base: GiNaC_print_csrc,
}
pub type GiNaC_print_csrc_float_inherited = GiNaC_print_csrc;
#[test]
fn bindgen_test_layout_GiNaC_print_csrc_float() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_csrc_float>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_csrc_float))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_csrc_float>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_csrc_float))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16print_csrc_float21get_class_info_staticEv"]
    pub fn GiNaC_print_csrc_float_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16print_csrc_floatC1Ev"]
    pub fn GiNaC_print_csrc_float_print_csrc_float(
        this: *mut GiNaC_print_csrc_float,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16print_csrc_floatC1ERSoj"]
    pub fn GiNaC_print_csrc_float_print_csrc_float1(
        this: *mut GiNaC_print_csrc_float,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_csrc_float {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_csrc_float_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_float_print_csrc_float(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_float_print_csrc_float1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_csrc_double {
    pub _base: GiNaC_print_csrc,
}
pub type GiNaC_print_csrc_double_inherited = GiNaC_print_csrc;
#[test]
fn bindgen_test_layout_GiNaC_print_csrc_double() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_csrc_double>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_csrc_double))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_csrc_double>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_csrc_double))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17print_csrc_double21get_class_info_staticEv"]
    pub fn GiNaC_print_csrc_double_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17print_csrc_doubleC1Ev"]
    pub fn GiNaC_print_csrc_double_print_csrc_double(
        this: *mut GiNaC_print_csrc_double,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17print_csrc_doubleC1ERSoj"]
    pub fn GiNaC_print_csrc_double_print_csrc_double1(
        this: *mut GiNaC_print_csrc_double,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_csrc_double {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_csrc_double_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_double_print_csrc_double(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_double_print_csrc_double1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_csrc_cl_N {
    pub _base: GiNaC_print_csrc,
}
pub type GiNaC_print_csrc_cl_N_inherited = GiNaC_print_csrc;
#[test]
fn bindgen_test_layout_GiNaC_print_csrc_cl_N() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_csrc_cl_N>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_print_csrc_cl_N))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_csrc_cl_N>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_csrc_cl_N))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15print_csrc_cl_N21get_class_info_staticEv"]
    pub fn GiNaC_print_csrc_cl_N_get_class_info_static(
    ) -> *const GiNaC_print_context_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15print_csrc_cl_NC1Ev"]
    pub fn GiNaC_print_csrc_cl_N_print_csrc_cl_N(
        this: *mut GiNaC_print_csrc_cl_N,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15print_csrc_cl_NC1ERSoj"]
    pub fn GiNaC_print_csrc_cl_N_print_csrc_cl_N1(
        this: *mut GiNaC_print_csrc_cl_N,
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    );
}
impl GiNaC_print_csrc_cl_N {
    #[inline]
    pub unsafe fn get_class_info_static(
    ) -> *const GiNaC_print_context_class_info {
        GiNaC_print_csrc_cl_N_get_class_info_static()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_cl_N_print_csrc_cl_N(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *mut std_ostream,
        options: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_print_csrc_cl_N_print_csrc_cl_N1(
            __bindgen_tmp.as_mut_ptr(),
            arg1,
            options,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
pub struct GiNaC_print_functor_impl__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_functor_impl {
    pub vtable_: *const GiNaC_print_functor_impl__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_print_functor_impl() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_functor_impl>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_print_functor_impl))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_functor_impl>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_functor_impl))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_ptrfun_handler<T, C> {
    pub _base: GiNaC_print_functor_impl,
    pub f: GiNaC_print_ptrfun_handler_F<T, C>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<C>>,
}
pub type GiNaC_print_ptrfun_handler_F<T, C> = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const T,
        arg2: *const C,
        arg3: ::std::os::raw::c_uint,
    ),
>;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_memfun_handler<C> {
    pub _base: GiNaC_print_functor_impl,
    pub f: GiNaC_print_memfun_handler_F<C>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<C>>,
}
pub type GiNaC_print_memfun_handler_F<C> = ::std::option::Option<
    unsafe extern "C" fn(c: *const C, level: ::std::os::raw::c_uint),
>;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_print_functor {
    pub impl_: u64,
}
#[test]
fn bindgen_test_layout_GiNaC_print_functor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_print_functor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_print_functor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_print_functor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_print_functor))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_print_functor>())).impl_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_print_functor),
            "::",
            stringify!(impl_)
        )
    );
}
pub type GiNaC_lst = [u64; 6usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_return_type_t {
    pub tinfo: *const std_type_info,
    pub rl: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GiNaC_return_type_t() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_return_type_t>(),
        16usize,
        concat!("Size of: ", stringify!(GiNaC_return_type_t))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_return_type_t>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_return_type_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_return_type_t>())).tinfo as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_return_type_t),
            "::",
            stringify!(tinfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_return_type_t>())).rl as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_return_type_t),
            "::",
            stringify!(rl)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_registered_class_options {
    pub name: *const ::std::os::raw::c_char,
    pub parent_name: *const ::std::os::raw::c_char,
    pub tinfo_key: *const std_type_info,
    pub print_dispatch_table: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_GiNaC_registered_class_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_registered_class_options>(),
        48usize,
        concat!("Size of: ", stringify!(GiNaC_registered_class_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_registered_class_options>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_registered_class_options))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_registered_class_options>())).name
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_registered_class_options),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_registered_class_options>()))
                .parent_name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_registered_class_options),
            "::",
            stringify!(parent_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_registered_class_options>())).tinfo_key
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_registered_class_options),
            "::",
            stringify!(tinfo_key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_registered_class_options>()))
                .print_dispatch_table as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_registered_class_options),
            "::",
            stringify!(print_dispatch_table)
        )
    );
}
pub type GiNaC_registered_class_info =
    GiNaC_class_info<GiNaC_registered_class_options>;
pub type GiNaC_exvector = [u64; 3usize];
pub type GiNaC_exset = [u64; 6usize];
pub type GiNaC_exmap = [u64; 6usize];
#[repr(C)]
pub struct GiNaC_map_function__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_map_function {
    pub vtable_: *const GiNaC_map_function__bindgen_vtable,
}
pub type GiNaC_map_function_argument_type = *const GiNaC_ex;
pub type GiNaC_map_function_result_type = GiNaC_ex;
#[test]
fn bindgen_test_layout_GiNaC_map_function() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_map_function>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_map_function))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_map_function>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_map_function))
    );
}
#[repr(C)]
pub struct GiNaC_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_visitor {
    pub vtable_: *const GiNaC_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_visitor))
    );
}
#[repr(C)]
pub struct GiNaC_basic__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_basic {
    pub vtable_: *const GiNaC_basic__bindgen_vtable,
    pub _base: GiNaC_refcounted,
    pub flags: ::std::os::raw::c_uint,
    pub hashvalue: ::std::os::raw::c_uint,
}
#[repr(C)]
pub struct GiNaC_basic_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_basic_visitor {
    pub vtable_: *const GiNaC_basic_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_basic_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_basic_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_basic_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_basic_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_basic_visitor))
    );
}
pub type GiNaC_basic_inherited = ::std::os::raw::c_void;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5basic8reg_infoE"]
    pub static mut GiNaC_basic_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_basic() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_basic>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_basic))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_basic>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_basic))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_basic>())).flags as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_basic),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_basic>())).hashvalue as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_basic),
            "::",
            stringify!(hashvalue)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic14print_dispatchERKNS_10class_infoINS_24registered_class_optionsEEERKNS_13print_contextEj"]
    pub fn GiNaC_basic_print_dispatch(
        this: *const GiNaC_basic,
        ri: *const GiNaC_registered_class_info,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic14subs_one_levelERKSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEEj"]
    pub fn GiNaC_basic_subs_one_level(
        this: *const GiNaC_basic,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4diffERKNS_6symbolEj"]
    pub fn GiNaC_basic_diff(
        this: *const GiNaC_basic,
        s: *const GiNaC_symbol,
        nth: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic7compareERKS0_"]
    pub fn GiNaC_basic_compare(
        this: *const GiNaC_basic,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic8is_equalERKS0_"]
    pub fn GiNaC_basic_is_equal(
        this: *const GiNaC_basic,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4holdEv"]
    pub fn GiNaC_basic_hold(this: *const GiNaC_basic) -> *const GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic20ensure_if_modifiableEv"]
    pub fn GiNaC_basic_ensure_if_modifiable(this: *const GiNaC_basic);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_basic_do_print(
        this: *const GiNaC_basic,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic13do_print_treeERKNS_10print_treeEj"]
    pub fn GiNaC_basic_do_print_tree(
        this: *const GiNaC_basic,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_basic_do_print_python_repr(
        this: *const GiNaC_basic,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5basicC1ERKS0_"]
    pub fn GiNaC_basic_basic(this: *mut GiNaC_basic, other: *const GiNaC_basic);
}
impl GiNaC_basic {
    #[inline]
    pub unsafe fn print_dispatch(
        &self,
        ri: *const GiNaC_registered_class_info,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_basic_print_dispatch(self, ri, c, level)
    }
    #[inline]
    pub unsafe fn subs_one_level(
        &self,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_basic_subs_one_level(self, m, options)
    }
    #[inline]
    pub unsafe fn diff(
        &self,
        s: *const GiNaC_symbol,
        nth: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_basic_diff(self, s, nth)
    }
    #[inline]
    pub unsafe fn compare(
        &self,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int {
        GiNaC_basic_compare(self, other)
    }
    #[inline]
    pub unsafe fn is_equal(&self, other: *const GiNaC_basic) -> bool {
        GiNaC_basic_is_equal(self, other)
    }
    #[inline]
    pub unsafe fn hold(&self) -> *const GiNaC_basic {
        GiNaC_basic_hold(self)
    }
    #[inline]
    pub unsafe fn ensure_if_modifiable(&self) {
        GiNaC_basic_ensure_if_modifiable(self)
    }
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_basic_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_tree(
        &self,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_basic_do_print_tree(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_basic_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new(other: *const GiNaC_basic) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_basic_basic(__bindgen_tmp.as_mut_ptr(), other);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4evalEv"]
    pub fn GiNaC_basic_eval(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic5evalfEv"]
    pub fn GiNaC_basic_evalf(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic5evalmEv"]
    pub fn GiNaC_basic_evalm(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic10eval_integEv"]
    pub fn GiNaC_basic_eval_integ(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic10eval_ncmulERKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_basic_eval_ncmul(
        this: *mut ::std::os::raw::c_void,
        v: *const GiNaC_exvector,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic12eval_indexedERKS0_"]
    pub fn GiNaC_basic_eval_indexed(
        this: *mut ::std::os::raw::c_void,
        i: *const GiNaC_basic,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic5printERKNS_13print_contextEj"]
    pub fn GiNaC_basic_print(
        this: *mut ::std::os::raw::c_void,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic8dbgprintEv"]
    pub fn GiNaC_basic_dbgprint(this: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic12dbgprinttreeEv"]
    pub fn GiNaC_basic_dbgprinttree(this: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic10precedenceEv"]
    pub fn GiNaC_basic_precedence(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4infoEj"]
    pub fn GiNaC_basic_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4nopsEv"]
    pub fn GiNaC_basic_nops(this: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic2opEm"]
    pub fn GiNaC_basic_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5basic6let_opEm"]
    pub fn GiNaC_basic_let_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> *mut GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic3hasERKNS_2exEj"]
    pub fn GiNaC_basic_has(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic5matchERKNS_2exERSt3mapIS1_S1_NS_10ex_is_lessESaISt4pairIS2_S1_EEE"]
    pub fn GiNaC_basic_match(
        this: *mut ::std::os::raw::c_void,
        pattern: *const GiNaC_ex,
        repls: *mut GiNaC_exmap,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic15match_same_typeERKS0_"]
    pub fn GiNaC_basic_match_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4subsERKSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEEj"]
    pub fn GiNaC_basic_subs(
        this: *mut ::std::os::raw::c_void,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic3mapERNS_12map_functionE"]
    pub fn GiNaC_basic_map(
        this: *mut ::std::os::raw::c_void,
        f: *mut GiNaC_map_function,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic13is_polynomialERKNS_2exE"]
    pub fn GiNaC_basic_is_polynomial(
        this: *mut ::std::os::raw::c_void,
        var: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic6degreeERKNS_2exE"]
    pub fn GiNaC_basic_degree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic7ldegreeERKNS_2exE"]
    pub fn GiNaC_basic_ldegree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic5coeffERKNS_2exEi"]
    pub fn GiNaC_basic_coeff(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
        n: ::std::os::raw::c_int,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic6expandEj"]
    pub fn GiNaC_basic_expand(
        this: *mut ::std::os::raw::c_void,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic7collectERKNS_2exEb"]
    pub fn GiNaC_basic_collect(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
        distributed: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic10derivativeERKNS_6symbolE"]
    pub fn GiNaC_basic_derivative(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic6seriesERKNS_10relationalEij"]
    pub fn GiNaC_basic_series(
        this: *mut ::std::os::raw::c_void,
        r: *const GiNaC_relational,
        order: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic6normalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEES9_"]
    pub fn GiNaC_basic_normal(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
        rev_lookup: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic11to_rationalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_basic_to_rational(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic13to_polynomialERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_basic_to_polynomial(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic15integer_contentEv"]
    pub fn GiNaC_basic_integer_content(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic4smodERKNS_7numericE"]
    pub fn GiNaC_basic_smod(
        this: *mut ::std::os::raw::c_void,
        xi: *const GiNaC_numeric,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic15max_coefficientEv"]
    pub fn GiNaC_basic_max_coefficient(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic16get_free_indicesEv"]
    pub fn GiNaC_basic_get_free_indices(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic11add_indexedERKNS_2exES3_"]
    pub fn GiNaC_basic_add_indexed(
        this: *mut ::std::os::raw::c_void,
        self_: *const GiNaC_ex,
        other: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic18scalar_mul_indexedERKNS_2exERKNS_7numericE"]
    pub fn GiNaC_basic_scalar_mul_indexed(
        this: *mut ::std::os::raw::c_void,
        self_: *const GiNaC_ex,
        other: *const GiNaC_numeric,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic13contract_withEN9__gnu_cxx17__normal_iteratorIPNS_2exESt6vectorIS3_SaIS3_EEEES8_RS7_"]
    pub fn GiNaC_basic_contract_with(
        this: *mut ::std::os::raw::c_void,
        self_: __gnu_cxx___normal_iterator<pointer>,
        other: __gnu_cxx___normal_iterator<pointer>,
        v: *mut GiNaC_exvector,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic11return_typeEv"]
    pub fn GiNaC_basic_return_type(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic17return_type_tinfoEv"]
    pub fn GiNaC_basic_return_type_tinfo(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_return_type_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic9conjugateEv"]
    pub fn GiNaC_basic_conjugate(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic9real_partEv"]
    pub fn GiNaC_basic_real_part(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic9imag_partEv"]
    pub fn GiNaC_basic_imag_part(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic17compare_same_typeERKS0_"]
    pub fn GiNaC_basic_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic18is_equal_same_typeERKS0_"]
    pub fn GiNaC_basic_is_equal_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic8calchashEv"]
    pub fn GiNaC_basic_calchash(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5basic7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_basic_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5basic12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_basic_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_library_init {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12library_init5countE"]
    pub static mut GiNaC_library_init_count: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_library_init() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_library_init>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_library_init))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_library_init>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_library_init))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12library_initC1Ev"]
    pub fn GiNaC_library_init_library_init(this: *mut GiNaC_library_init);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12library_initD1Ev"]
    pub fn GiNaC_library_init_library_init_destructor(
        this: *mut GiNaC_library_init,
    );
}
impl GiNaC_library_init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_library_init_library_init(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_library_init_library_init_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL19library_initializerE"]
    pub static mut GiNaC_library_initializer: GiNaC_library_init;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_ex {
    pub bp: GiNaC_ptr<GiNaC_basic>,
}
#[test]
fn bindgen_test_layout_GiNaC_ex() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ex>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_ex))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ex>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_ex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GiNaC_ex>())).bp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_ex),
            "::",
            stringify!(bp)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex5beginEv"]
    pub fn GiNaC_ex_begin(this: *const GiNaC_ex) -> GiNaC_const_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex3endEv"]
    pub fn GiNaC_ex_end(this: *const GiNaC_ex) -> GiNaC_const_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex14preorder_beginEv"]
    pub fn GiNaC_ex_preorder_begin(
        this: *const GiNaC_ex,
    ) -> GiNaC_const_preorder_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex12preorder_endEv"]
    pub fn GiNaC_ex_preorder_end(
        this: *const GiNaC_ex,
    ) -> GiNaC_const_preorder_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex15postorder_beginEv"]
    pub fn GiNaC_ex_postorder_begin(
        this: *const GiNaC_ex,
    ) -> GiNaC_const_postorder_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex13postorder_endEv"]
    pub fn GiNaC_ex_postorder_end(
        this: *const GiNaC_ex,
    ) -> GiNaC_const_postorder_iterator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex5printERKNS_13print_contextEj"]
    pub fn GiNaC_ex_print(
        this: *const GiNaC_ex,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex8dbgprintEv"]
    pub fn GiNaC_ex_dbgprint(this: *const GiNaC_ex);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex12dbgprinttreeEv"]
    pub fn GiNaC_ex_dbgprinttree(this: *const GiNaC_ex);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2ex6let_opEm"]
    pub fn GiNaC_ex_let_op(this: *mut GiNaC_ex, i: size_t) -> *mut GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex3lhsEv"]
    pub fn GiNaC_ex_lhs(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex3rhsEv"]
    pub fn GiNaC_ex_rhs(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex4findERKS0_RSt3setIS0_NS_10ex_is_lessESaIS0_EE"]
    pub fn GiNaC_ex_find(
        this: *const GiNaC_ex,
        pattern: *const GiNaC_ex,
        found: *mut GiNaC_exset,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex5matchERKS0_"]
    pub fn GiNaC_ex_match(
        this: *const GiNaC_ex,
        pattern: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex4subsERKSt3mapIS0_S0_NS_10ex_is_lessESaISt4pairIKS0_S0_EEEj"]
    pub fn GiNaC_ex_subs(
        this: *const GiNaC_ex,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex4subsERKNS_9containerINSt7__cxx114listEEES6_j"]
    pub fn GiNaC_ex_subs1(
        this: *const GiNaC_ex,
        ls: *const GiNaC_lst,
        lr: *const GiNaC_lst,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex4subsERKS0_j"]
    pub fn GiNaC_ex_subs2(
        this: *const GiNaC_ex,
        e: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex3mapEPFS0_RKS0_E"]
    pub fn GiNaC_ex_map(
        this: *const GiNaC_ex,
        f: ::std::option::Option<
            unsafe extern "C" fn(e: *const GiNaC_ex) -> GiNaC_ex,
        >,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex17traverse_preorderERNS_7visitorE"]
    pub fn GiNaC_ex_traverse_preorder(
        this: *const GiNaC_ex,
        v: *mut GiNaC_visitor,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex18traverse_postorderERNS_7visitorE"]
    pub fn GiNaC_ex_traverse_postorder(
        this: *const GiNaC_ex,
        v: *mut GiNaC_visitor,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex13is_polynomialERKS0_"]
    pub fn GiNaC_ex_is_polynomial(
        this: *const GiNaC_ex,
        vars: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex6expandEj"]
    pub fn GiNaC_ex_expand(
        this: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex4diffERKNS_6symbolEj"]
    pub fn GiNaC_ex_diff(
        this: *const GiNaC_ex,
        s: *const GiNaC_symbol,
        nth: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex6seriesERKS0_ij"]
    pub fn GiNaC_ex_series(
        this: *const GiNaC_ex,
        r: *const GiNaC_ex,
        order: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex6normalEv"]
    pub fn GiNaC_ex_normal(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex11to_rationalERSt3mapIS0_S0_NS_10ex_is_lessESaISt4pairIKS0_S0_EEE"]
    pub fn GiNaC_ex_to_rational(
        this: *const GiNaC_ex,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex13to_polynomialERSt3mapIS0_S0_NS_10ex_is_lessESaISt4pairIKS0_S0_EEE"]
    pub fn GiNaC_ex_to_polynomial(
        this: *const GiNaC_ex,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex5numerEv"]
    pub fn GiNaC_ex_numer(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex5denomEv"]
    pub fn GiNaC_ex_denom(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex11numer_denomEv"]
    pub fn GiNaC_ex_numer_denom(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex4unitERKS0_"]
    pub fn GiNaC_ex_unit(this: *const GiNaC_ex, x: *const GiNaC_ex)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex7contentERKS0_"]
    pub fn GiNaC_ex_content(
        this: *const GiNaC_ex,
        x: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex15integer_contentEv"]
    pub fn GiNaC_ex_integer_content(this: *const GiNaC_ex) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex8primpartERKS0_"]
    pub fn GiNaC_ex_primpart(
        this: *const GiNaC_ex,
        x: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex8primpartERKS0_S2_"]
    pub fn GiNaC_ex_primpart1(
        this: *const GiNaC_ex,
        x: *const GiNaC_ex,
        cont: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex12unitcontprimERKS0_RS0_S3_S3_"]
    pub fn GiNaC_ex_unitcontprim(
        this: *const GiNaC_ex,
        x: *const GiNaC_ex,
        u: *mut GiNaC_ex,
        c: *mut GiNaC_ex,
        p: *mut GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex15max_coefficientEv"]
    pub fn GiNaC_ex_max_coefficient(this: *const GiNaC_ex) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex16simplify_indexedEj"]
    pub fn GiNaC_ex_simplify_indexed(
        this: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex16simplify_indexedERKNS_15scalar_productsEj"]
    pub fn GiNaC_ex_simplify_indexed1(
        this: *const GiNaC_ex,
        sp: *const GiNaC_scalar_products,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex7compareERKS0_"]
    pub fn GiNaC_ex_compare(
        this: *const GiNaC_ex,
        other: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex8is_equalERKS0_"]
    pub fn GiNaC_ex_is_equal(
        this: *const GiNaC_ex,
        other: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex14is_zero_matrixEv"]
    pub fn GiNaC_ex_is_zero_matrix(this: *const GiNaC_ex) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex10symmetrizeEv"]
    pub fn GiNaC_ex_symmetrize(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex10symmetrizeERKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_ex_symmetrize1(
        this: *const GiNaC_ex,
        l: *const GiNaC_lst,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex14antisymmetrizeEv"]
    pub fn GiNaC_ex_antisymmetrize(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex14antisymmetrizeERKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_ex_antisymmetrize1(
        this: *const GiNaC_ex,
        l: *const GiNaC_lst,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex17symmetrize_cyclicEv"]
    pub fn GiNaC_ex_symmetrize_cyclic(this: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC2ex17symmetrize_cyclicERKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_ex_symmetrize_cyclic1(
        this: *const GiNaC_ex,
        l: *const GiNaC_lst,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Ev"]
    pub fn GiNaC_ex_ex(this: *mut GiNaC_ex);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1ERKNS_5basicE"]
    pub fn GiNaC_ex_ex1(this: *mut GiNaC_ex, other: *const GiNaC_basic);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Ei"]
    pub fn GiNaC_ex_ex2(this: *mut GiNaC_ex, i: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Ej"]
    pub fn GiNaC_ex_ex3(this: *mut GiNaC_ex, i: ::std::os::raw::c_uint);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1El"]
    pub fn GiNaC_ex_ex4(this: *mut GiNaC_ex, i: ::std::os::raw::c_long);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Em"]
    pub fn GiNaC_ex_ex5(this: *mut GiNaC_ex, i: ::std::os::raw::c_ulong);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Ex"]
    pub fn GiNaC_ex_ex6(this: *mut GiNaC_ex, i: ::std::os::raw::c_longlong);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Ey"]
    pub fn GiNaC_ex_ex7(this: *mut GiNaC_ex, i: ::std::os::raw::c_ulonglong);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1Ed"]
    pub fn GiNaC_ex_ex8(this: *mut GiNaC_ex, d: f64);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2exC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERKS0_"]
    pub fn GiNaC_ex_ex9(
        this: *mut GiNaC_ex,
        s: *const std_string,
        l: *const GiNaC_ex,
    );
}
impl GiNaC_ex {
    #[inline]
    pub unsafe fn begin(&self) -> GiNaC_const_iterator {
        GiNaC_ex_begin(self)
    }
    #[inline]
    pub unsafe fn end(&self) -> GiNaC_const_iterator {
        GiNaC_ex_end(self)
    }
    #[inline]
    pub unsafe fn preorder_begin(&self) -> GiNaC_const_preorder_iterator {
        GiNaC_ex_preorder_begin(self)
    }
    #[inline]
    pub unsafe fn preorder_end(&self) -> GiNaC_const_preorder_iterator {
        GiNaC_ex_preorder_end(self)
    }
    #[inline]
    pub unsafe fn postorder_begin(&self) -> GiNaC_const_postorder_iterator {
        GiNaC_ex_postorder_begin(self)
    }
    #[inline]
    pub unsafe fn postorder_end(&self) -> GiNaC_const_postorder_iterator {
        GiNaC_ex_postorder_end(self)
    }
    #[inline]
    pub unsafe fn print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_ex_print(self, c, level)
    }
    #[inline]
    pub unsafe fn dbgprint(&self) {
        GiNaC_ex_dbgprint(self)
    }
    #[inline]
    pub unsafe fn dbgprinttree(&self) {
        GiNaC_ex_dbgprinttree(self)
    }
    #[inline]
    pub unsafe fn let_op(&mut self, i: size_t) -> *mut GiNaC_ex {
        GiNaC_ex_let_op(self, i)
    }
    #[inline]
    pub unsafe fn lhs(&self) -> GiNaC_ex {
        GiNaC_ex_lhs(self)
    }
    #[inline]
    pub unsafe fn rhs(&self) -> GiNaC_ex {
        GiNaC_ex_rhs(self)
    }
    #[inline]
    pub unsafe fn find(
        &self,
        pattern: *const GiNaC_ex,
        found: *mut GiNaC_exset,
    ) -> bool {
        GiNaC_ex_find(self, pattern, found)
    }
    #[inline]
    pub unsafe fn match_(&self, pattern: *const GiNaC_ex) -> bool {
        GiNaC_ex_match(self, pattern)
    }
    #[inline]
    pub unsafe fn subs(
        &self,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_subs(self, m, options)
    }
    #[inline]
    pub unsafe fn subs1(
        &self,
        ls: *const GiNaC_lst,
        lr: *const GiNaC_lst,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_subs1(self, ls, lr, options)
    }
    #[inline]
    pub unsafe fn subs2(
        &self,
        e: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_subs2(self, e, options)
    }
    #[inline]
    pub unsafe fn map(
        &self,
        f: ::std::option::Option<
            unsafe extern "C" fn(e: *const GiNaC_ex) -> GiNaC_ex,
        >,
    ) -> GiNaC_ex {
        GiNaC_ex_map(self, f)
    }
    #[inline]
    pub unsafe fn traverse_preorder(&self, v: *mut GiNaC_visitor) {
        GiNaC_ex_traverse_preorder(self, v)
    }
    #[inline]
    pub unsafe fn traverse_postorder(&self, v: *mut GiNaC_visitor) {
        GiNaC_ex_traverse_postorder(self, v)
    }
    #[inline]
    pub unsafe fn is_polynomial(&self, vars: *const GiNaC_ex) -> bool {
        GiNaC_ex_is_polynomial(self, vars)
    }
    #[inline]
    pub unsafe fn expand(&self, options: ::std::os::raw::c_uint) -> GiNaC_ex {
        GiNaC_ex_expand(self, options)
    }
    #[inline]
    pub unsafe fn diff(
        &self,
        s: *const GiNaC_symbol,
        nth: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_diff(self, s, nth)
    }
    #[inline]
    pub unsafe fn series(
        &self,
        r: *const GiNaC_ex,
        order: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_series(self, r, order, options)
    }
    #[inline]
    pub unsafe fn normal(&self) -> GiNaC_ex {
        GiNaC_ex_normal(self)
    }
    #[inline]
    pub unsafe fn to_rational(&self, repl: *mut GiNaC_exmap) -> GiNaC_ex {
        GiNaC_ex_to_rational(self, repl)
    }
    #[inline]
    pub unsafe fn to_polynomial(&self, repl: *mut GiNaC_exmap) -> GiNaC_ex {
        GiNaC_ex_to_polynomial(self, repl)
    }
    #[inline]
    pub unsafe fn numer(&self) -> GiNaC_ex {
        GiNaC_ex_numer(self)
    }
    #[inline]
    pub unsafe fn denom(&self) -> GiNaC_ex {
        GiNaC_ex_denom(self)
    }
    #[inline]
    pub unsafe fn numer_denom(&self) -> GiNaC_ex {
        GiNaC_ex_numer_denom(self)
    }
    #[inline]
    pub unsafe fn unit(&self, x: *const GiNaC_ex) -> GiNaC_ex {
        GiNaC_ex_unit(self, x)
    }
    #[inline]
    pub unsafe fn content(&self, x: *const GiNaC_ex) -> GiNaC_ex {
        GiNaC_ex_content(self, x)
    }
    #[inline]
    pub unsafe fn integer_content(&self) -> GiNaC_numeric {
        GiNaC_ex_integer_content(self)
    }
    #[inline]
    pub unsafe fn primpart(&self, x: *const GiNaC_ex) -> GiNaC_ex {
        GiNaC_ex_primpart(self, x)
    }
    #[inline]
    pub unsafe fn primpart1(
        &self,
        x: *const GiNaC_ex,
        cont: *const GiNaC_ex,
    ) -> GiNaC_ex {
        GiNaC_ex_primpart1(self, x, cont)
    }
    #[inline]
    pub unsafe fn unitcontprim(
        &self,
        x: *const GiNaC_ex,
        u: *mut GiNaC_ex,
        c: *mut GiNaC_ex,
        p: *mut GiNaC_ex,
    ) {
        GiNaC_ex_unitcontprim(self, x, u, c, p)
    }
    #[inline]
    pub unsafe fn max_coefficient(&self) -> GiNaC_numeric {
        GiNaC_ex_max_coefficient(self)
    }
    #[inline]
    pub unsafe fn simplify_indexed(
        &self,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_simplify_indexed(self, options)
    }
    #[inline]
    pub unsafe fn simplify_indexed1(
        &self,
        sp: *const GiNaC_scalar_products,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_ex_simplify_indexed1(self, sp, options)
    }
    #[inline]
    pub unsafe fn compare(
        &self,
        other: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int {
        GiNaC_ex_compare(self, other)
    }
    #[inline]
    pub unsafe fn is_equal(&self, other: *const GiNaC_ex) -> bool {
        GiNaC_ex_is_equal(self, other)
    }
    #[inline]
    pub unsafe fn is_zero_matrix(&self) -> bool {
        GiNaC_ex_is_zero_matrix(self)
    }
    #[inline]
    pub unsafe fn symmetrize(&self) -> GiNaC_ex {
        GiNaC_ex_symmetrize(self)
    }
    #[inline]
    pub unsafe fn symmetrize1(&self, l: *const GiNaC_lst) -> GiNaC_ex {
        GiNaC_ex_symmetrize1(self, l)
    }
    #[inline]
    pub unsafe fn antisymmetrize(&self) -> GiNaC_ex {
        GiNaC_ex_antisymmetrize(self)
    }
    #[inline]
    pub unsafe fn antisymmetrize1(&self, l: *const GiNaC_lst) -> GiNaC_ex {
        GiNaC_ex_antisymmetrize1(self, l)
    }
    #[inline]
    pub unsafe fn symmetrize_cyclic(&self) -> GiNaC_ex {
        GiNaC_ex_symmetrize_cyclic(self)
    }
    #[inline]
    pub unsafe fn symmetrize_cyclic1(&self, l: *const GiNaC_lst) -> GiNaC_ex {
        GiNaC_ex_symmetrize_cyclic1(self, l)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(other: *const GiNaC_basic) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex1(__bindgen_tmp.as_mut_ptr(), other);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(i: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex2(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(i: ::std::os::raw::c_uint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex3(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(i: ::std::os::raw::c_long) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex4(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(i: ::std::os::raw::c_ulong) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex5(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(i: ::std::os::raw::c_longlong) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex6(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new7(i: ::std::os::raw::c_ulonglong) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex7(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new8(d: f64) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex8(__bindgen_tmp.as_mut_ptr(), d);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new9(s: *const std_string, l: *const GiNaC_ex) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ex_ex9(__bindgen_tmp.as_mut_ptr(), s, l);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8_num0_bpE"]
    pub static mut GiNaC__num0_bp: *const GiNaC_basic;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_const_iterator {
    pub _base: u8,
    pub e: GiNaC_ex,
    pub i: size_t,
}
#[test]
fn bindgen_test_layout_GiNaC_const_iterator() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_const_iterator>(),
        16usize,
        concat!("Size of: ", stringify!(GiNaC_const_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_const_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_const_iterator))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_const_iterator>())).e as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_const_iterator),
            "::",
            stringify!(e)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_const_iterator>())).i as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_const_iterator),
            "::",
            stringify!(i)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_internal__iter_rep {
    pub e: GiNaC_ex,
    pub i: size_t,
    pub i_end: size_t,
}
#[test]
fn bindgen_test_layout_GiNaC_internal__iter_rep() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_internal__iter_rep>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_internal__iter_rep))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_internal__iter_rep>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_internal__iter_rep))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_internal__iter_rep>())).e as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_internal__iter_rep),
            "::",
            stringify!(e)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_internal__iter_rep>())).i as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_internal__iter_rep),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_internal__iter_rep>())).i_end
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_internal__iter_rep),
            "::",
            stringify!(i_end)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_const_preorder_iterator {
    pub _base: u8,
    pub s: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_GiNaC_const_preorder_iterator() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_const_preorder_iterator>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_const_preorder_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_const_preorder_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_const_preorder_iterator))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_const_preorder_iterator>())).s
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_const_preorder_iterator),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_const_postorder_iterator {
    pub _base: u8,
    pub s: [u64; 3usize],
}
#[test]
fn bindgen_test_layout_GiNaC_const_postorder_iterator() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_const_postorder_iterator>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_const_postorder_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_const_postorder_iterator>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_const_postorder_iterator))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_const_postorder_iterator>())).s
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_const_postorder_iterator),
            "::",
            stringify!(s)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_ex_is_less {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_ex_is_less() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ex_is_less>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_ex_is_less))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ex_is_less>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_ex_is_less))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_ex_is_equal {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_ex_is_equal() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ex_is_equal>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_ex_is_equal))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ex_is_equal>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_ex_is_equal))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_op0_is_equal {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_op0_is_equal() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_op0_is_equal>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_op0_is_equal))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_op0_is_equal>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_op0_is_equal))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_ex_swap {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_ex_swap() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ex_swap>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_ex_swap))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ex_swap>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_ex_swap))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_map_function {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const GiNaC_ex) -> GiNaC_ex,
    >,
}
#[test]
fn bindgen_test_layout_GiNaC_pointer_to_map_function() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_pointer_to_map_function>(),
        16usize,
        concat!("Size of: ", stringify!(GiNaC_pointer_to_map_function))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_pointer_to_map_function>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_pointer_to_map_function))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_pointer_to_map_function>())).ptr
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_pointer_to_map_function),
            "::",
            stringify!(ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_map_function_1arg<T1> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const GiNaC_ex, arg2: T1) -> GiNaC_ex,
    >,
    pub arg1: T1,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T1>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_map_function_2args<T1, T2> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const GiNaC_ex,
            arg2: T1,
            arg3: T2,
        ) -> GiNaC_ex,
    >,
    pub arg1: T1,
    pub arg2: T2,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<T2>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_map_function_3args<T1, T2, T3> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const GiNaC_ex,
            arg2: T1,
            arg3: T2,
            arg4: T3,
        ) -> GiNaC_ex,
    >,
    pub arg1: T1,
    pub arg2: T2,
    pub arg3: T3,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<T2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<T3>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_member_to_map_function<C> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const GiNaC_ex) -> GiNaC_ex,
    >,
    pub c: *mut C,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<C>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_member_to_map_function_1arg<C, T1> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const GiNaC_ex, arg2: T1) -> GiNaC_ex,
    >,
    pub c: *mut C,
    pub arg1: T1,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<C>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<T1>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_member_to_map_function_2args<C, T1, T2> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const GiNaC_ex,
            arg2: T1,
            arg3: T2,
        ) -> GiNaC_ex,
    >,
    pub c: *mut C,
    pub arg1: T1,
    pub arg2: T2,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<C>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<T1>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<T2>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pointer_to_member_to_map_function_3args<C, T1, T2, T3> {
    pub _base: GiNaC_map_function,
    pub ptr: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const GiNaC_ex,
            arg2: T1,
            arg3: T2,
            arg4: T3,
        ) -> GiNaC_ex,
    >,
    pub c: *mut C,
    pub arg1: T1,
    pub arg2: T2,
    pub arg3: T3,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<C>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<T1>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<T2>>,
    pub _phantom_3: ::std::marker::PhantomData<::std::cell::UnsafeCell<T3>>,
}
pub type GiNaC_archive_node_id = ::std::os::raw::c_uint;
pub type GiNaC_archive_atom = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_archive_node {
    pub a: *mut GiNaC_archive,
    pub props: [u64; 3usize],
    pub has_expression: bool,
    pub e: GiNaC_ex,
}
pub const GiNaC_archive_node_property_type_PTYPE_BOOL:
    GiNaC_archive_node_property_type = 0;
pub const GiNaC_archive_node_property_type_PTYPE_UNSIGNED:
    GiNaC_archive_node_property_type = 1;
pub const GiNaC_archive_node_property_type_PTYPE_STRING:
    GiNaC_archive_node_property_type = 2;
pub const GiNaC_archive_node_property_type_PTYPE_NODE:
    GiNaC_archive_node_property_type = 3;
pub type GiNaC_archive_node_property_type = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_archive_node_property_info {
    pub type_: GiNaC_archive_node_property_type,
    pub name: std_string,
    pub count: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GiNaC_archive_node_property_info() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_archive_node_property_info>(),
        48usize,
        concat!("Size of: ", stringify!(GiNaC_archive_node_property_info))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_archive_node_property_info>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(GiNaC_archive_node_property_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_property_info>())).type_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_property_info),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_property_info>())).name
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_property_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_property_info>())).count
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_property_info),
            "::",
            stringify!(count)
        )
    );
}
pub type GiNaC_archive_node_propinfovector = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_archive_node_property {
    pub type_: GiNaC_archive_node_property_type,
    pub name: GiNaC_archive_atom,
    pub value: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GiNaC_archive_node_property() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_archive_node_property>(),
        12usize,
        concat!("Size of: ", stringify!(GiNaC_archive_node_property))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_archive_node_property>(),
        4usize,
        concat!("Alignment of ", stringify!(GiNaC_archive_node_property))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_property>())).type_
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_property),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_property>())).name
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_property),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_property>())).value
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_property),
            "::",
            stringify!(value)
        )
    );
}
pub type GiNaC_archive_node_archive_node_cit =
    __gnu_cxx___normal_iterator<const_pointer>;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_archive_node_archive_node_cit_range {
    pub begin: GiNaC_archive_node_archive_node_cit,
    pub end: GiNaC_archive_node_archive_node_cit,
}
#[test]
fn bindgen_test_layout_GiNaC_archive_node_archive_node_cit_range() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_archive_node_archive_node_cit_range>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(GiNaC_archive_node_archive_node_cit_range)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_archive_node_archive_node_cit_range>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(GiNaC_archive_node_archive_node_cit_range)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_archive_node_cit_range>(
            )))
            .begin as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_archive_node_cit_range),
            "::",
            stringify!(begin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node_archive_node_cit_range>(
            )))
            .end as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node_archive_node_cit_range),
            "::",
            stringify!(end)
        )
    );
}
#[test]
fn bindgen_test_layout_GiNaC_archive_node() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_archive_node>(),
        48usize,
        concat!("Size of: ", stringify!(GiNaC_archive_node))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_archive_node>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_archive_node))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node>())).a as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node>())).props as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node),
            "::",
            stringify!(props)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node>())).has_expression
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node),
            "::",
            stringify!(has_expression)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_node>())).e as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_node),
            "::",
            stringify!(e)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12archive_node8add_boolERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEb"]
    pub fn GiNaC_archive_node_add_bool(
        this: *mut GiNaC_archive_node,
        name: *const std_string,
        value: bool,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12archive_node12add_unsignedERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEj"]
    pub fn GiNaC_archive_node_add_unsigned(
        this: *mut GiNaC_archive_node,
        name: *const std_string,
        value: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12archive_node10add_stringERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
    pub fn GiNaC_archive_node_add_string(
        this: *mut GiNaC_archive_node,
        name: *const std_string,
        value: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12archive_node6add_exERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERKNS_2exE"]
    pub fn GiNaC_archive_node_add_ex(
        this: *mut GiNaC_archive_node,
        name: *const std_string,
        value: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node9find_boolERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERbj"]
    pub fn GiNaC_archive_node_find_bool(
        this: *const GiNaC_archive_node,
        name: *const std_string,
        ret: *mut bool,
        index: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node13find_unsignedERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERjj"]
    pub fn GiNaC_archive_node_find_unsigned(
        this: *const GiNaC_archive_node,
        name: *const std_string,
        ret: *mut ::std::os::raw::c_uint,
        index: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node11find_stringERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERS6_j"]
    pub fn GiNaC_archive_node_find_string(
        this: *const GiNaC_archive_node,
        name: *const std_string,
        ret: *mut std_string,
        index: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node10find_firstERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_archive_node_find_first(
        this: *const GiNaC_archive_node,
        name: *const std_string,
    ) -> GiNaC_archive_node_archive_node_cit;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node9find_lastERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_archive_node_find_last(
        this: *const GiNaC_archive_node,
        name: *const std_string,
    ) -> GiNaC_archive_node_archive_node_cit;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node19find_property_rangeERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
    pub fn GiNaC_archive_node_find_property_range(
        this: *const GiNaC_archive_node,
        name1: *const std_string,
        name2: *const std_string,
    ) -> GiNaC_archive_node_archive_node_cit_range;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node7find_exERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERNS_2exERNS_9containerINS1_4listEEEj"]
    pub fn GiNaC_archive_node_find_ex(
        this: *const GiNaC_archive_node,
        name: *const std_string,
        ret: *mut GiNaC_ex,
        sym_lst: *mut GiNaC_lst,
        index: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node14find_ex_by_locEN9__gnu_cxx17__normal_iteratorIPKNS0_8propertyESt6vectorIS3_SaIS3_EEEERNS_2exERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_archive_node_find_ex_by_loc(
        this: *const GiNaC_archive_node,
        loc: GiNaC_archive_node_archive_node_cit,
        ret: *mut GiNaC_ex,
        sym_lst: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node12find_ex_nodeERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEj"]
    pub fn GiNaC_archive_node_find_ex_node(
        this: *const GiNaC_archive_node,
        name: *const std_string,
        index: ::std::os::raw::c_uint,
    ) -> *const GiNaC_archive_node;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node14get_propertiesERSt6vectorINS0_13property_infoESaIS2_EE"]
    pub fn GiNaC_archive_node_get_properties(
        this: *const GiNaC_archive_node,
        v: *mut GiNaC_archive_node_propinfovector,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node9unarchiveERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_archive_node_unarchive(
        this: *const GiNaC_archive_node,
        sym_lst: *mut GiNaC_lst,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node14has_same_ex_asERKS0_"]
    pub fn GiNaC_archive_node_has_same_ex_as(
        this: *const GiNaC_archive_node,
        other: *const GiNaC_archive_node,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12archive_node6forgetEv"]
    pub fn GiNaC_archive_node_forget(this: *mut GiNaC_archive_node);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC12archive_node8printrawERSo"]
    pub fn GiNaC_archive_node_printraw(
        this: *const GiNaC_archive_node,
        os: *mut std_ostream,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12archive_nodeC1ERNS_7archiveERKNS_2exE"]
    pub fn GiNaC_archive_node_archive_node(
        this: *mut GiNaC_archive_node,
        ar: *mut GiNaC_archive,
        expr: *const GiNaC_ex,
    );
}
impl GiNaC_archive_node {
    #[inline]
    pub unsafe fn add_bool(&mut self, name: *const std_string, value: bool) {
        GiNaC_archive_node_add_bool(self, name, value)
    }
    #[inline]
    pub unsafe fn add_unsigned(
        &mut self,
        name: *const std_string,
        value: ::std::os::raw::c_uint,
    ) {
        GiNaC_archive_node_add_unsigned(self, name, value)
    }
    #[inline]
    pub unsafe fn add_string(
        &mut self,
        name: *const std_string,
        value: *const std_string,
    ) {
        GiNaC_archive_node_add_string(self, name, value)
    }
    #[inline]
    pub unsafe fn add_ex(
        &mut self,
        name: *const std_string,
        value: *const GiNaC_ex,
    ) {
        GiNaC_archive_node_add_ex(self, name, value)
    }
    #[inline]
    pub unsafe fn find_bool(
        &self,
        name: *const std_string,
        ret: *mut bool,
        index: ::std::os::raw::c_uint,
    ) -> bool {
        GiNaC_archive_node_find_bool(self, name, ret, index)
    }
    #[inline]
    pub unsafe fn find_unsigned(
        &self,
        name: *const std_string,
        ret: *mut ::std::os::raw::c_uint,
        index: ::std::os::raw::c_uint,
    ) -> bool {
        GiNaC_archive_node_find_unsigned(self, name, ret, index)
    }
    #[inline]
    pub unsafe fn find_string(
        &self,
        name: *const std_string,
        ret: *mut std_string,
        index: ::std::os::raw::c_uint,
    ) -> bool {
        GiNaC_archive_node_find_string(self, name, ret, index)
    }
    #[inline]
    pub unsafe fn find_first(
        &self,
        name: *const std_string,
    ) -> GiNaC_archive_node_archive_node_cit {
        GiNaC_archive_node_find_first(self, name)
    }
    #[inline]
    pub unsafe fn find_last(
        &self,
        name: *const std_string,
    ) -> GiNaC_archive_node_archive_node_cit {
        GiNaC_archive_node_find_last(self, name)
    }
    #[inline]
    pub unsafe fn find_property_range(
        &self,
        name1: *const std_string,
        name2: *const std_string,
    ) -> GiNaC_archive_node_archive_node_cit_range {
        GiNaC_archive_node_find_property_range(self, name1, name2)
    }
    #[inline]
    pub unsafe fn find_ex(
        &self,
        name: *const std_string,
        ret: *mut GiNaC_ex,
        sym_lst: *mut GiNaC_lst,
        index: ::std::os::raw::c_uint,
    ) -> bool {
        GiNaC_archive_node_find_ex(self, name, ret, sym_lst, index)
    }
    #[inline]
    pub unsafe fn find_ex_by_loc(
        &self,
        loc: GiNaC_archive_node_archive_node_cit,
        ret: *mut GiNaC_ex,
        sym_lst: *mut GiNaC_lst,
    ) {
        GiNaC_archive_node_find_ex_by_loc(self, loc, ret, sym_lst)
    }
    #[inline]
    pub unsafe fn find_ex_node(
        &self,
        name: *const std_string,
        index: ::std::os::raw::c_uint,
    ) -> *const GiNaC_archive_node {
        GiNaC_archive_node_find_ex_node(self, name, index)
    }
    #[inline]
    pub unsafe fn get_properties(
        &self,
        v: *mut GiNaC_archive_node_propinfovector,
    ) {
        GiNaC_archive_node_get_properties(self, v)
    }
    #[inline]
    pub unsafe fn unarchive(&self, sym_lst: *mut GiNaC_lst) -> GiNaC_ex {
        GiNaC_archive_node_unarchive(self, sym_lst)
    }
    #[inline]
    pub unsafe fn has_same_ex_as(
        &self,
        other: *const GiNaC_archive_node,
    ) -> bool {
        GiNaC_archive_node_has_same_ex_as(self, other)
    }
    #[inline]
    pub unsafe fn forget(&mut self) {
        GiNaC_archive_node_forget(self)
    }
    #[inline]
    pub unsafe fn printraw(&self, os: *mut std_ostream) {
        GiNaC_archive_node_printraw(self, os)
    }
    #[inline]
    pub unsafe fn new(ar: *mut GiNaC_archive, expr: *const GiNaC_ex) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_archive_node_archive_node(__bindgen_tmp.as_mut_ptr(), ar, expr);
        __bindgen_tmp.assume_init()
    }
}
pub type GiNaC_synthesize_func =
    ::std::option::Option<unsafe extern "C" fn() -> *mut GiNaC_basic>;
pub type GiNaC_unarchive_map_t = u8;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_unarchive_table_t {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17unarchive_table_t8usecountE"]
    pub static mut GiNaC_unarchive_table_t_usecount: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17unarchive_table_t10unarch_mapB5cxx11E"]
    pub static mut GiNaC_unarchive_table_t_unarch_map:
        *mut GiNaC_unarchive_map_t;
}
#[test]
fn bindgen_test_layout_GiNaC_unarchive_table_t() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_unarchive_table_t>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_unarchive_table_t))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_unarchive_table_t>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_unarchive_table_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC17unarchive_table_t4findERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_unarchive_table_t_find(
        this: *const GiNaC_unarchive_table_t,
        classname: *const std_string,
    ) -> GiNaC_synthesize_func;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17unarchive_table_t6insertERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEPFPNS_5basicEvE"]
    pub fn GiNaC_unarchive_table_t_insert(
        this: *mut GiNaC_unarchive_table_t,
        classname: *const std_string,
        f: GiNaC_synthesize_func,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17unarchive_table_tC1Ev"]
    pub fn GiNaC_unarchive_table_t_unarchive_table_t(
        this: *mut GiNaC_unarchive_table_t,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17unarchive_table_tD1Ev"]
    pub fn GiNaC_unarchive_table_t_unarchive_table_t_destructor(
        this: *mut GiNaC_unarchive_table_t,
    );
}
impl GiNaC_unarchive_table_t {
    #[inline]
    pub unsafe fn find(
        &self,
        classname: *const std_string,
    ) -> GiNaC_synthesize_func {
        GiNaC_unarchive_table_t_find(self, classname)
    }
    #[inline]
    pub unsafe fn insert(
        &mut self,
        classname: *const std_string,
        f: GiNaC_synthesize_func,
    ) {
        GiNaC_unarchive_table_t_insert(self, classname, f)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_unarchive_table_t_unarchive_table_t(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_unarchive_table_t_unarchive_table_t_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL21unarch_table_instanceE"]
    pub static mut GiNaC_unarch_table_instance: GiNaC_unarchive_table_t;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_archive {
    pub nodes: [u64; 3usize],
    pub exprs: [u64; 3usize],
    pub atoms: [u64; 3usize],
    pub inverse_atoms: [u64; 6usize],
    pub exprtable: [u64; 6usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_archive_archived_ex {
    pub name: GiNaC_archive_atom,
    pub root: GiNaC_archive_node_id,
}
#[test]
fn bindgen_test_layout_GiNaC_archive_archived_ex() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_archive_archived_ex>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_archive_archived_ex))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_archive_archived_ex>(),
        4usize,
        concat!("Alignment of ", stringify!(GiNaC_archive_archived_ex))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_archived_ex>())).name
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_archived_ex),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive_archived_ex>())).root
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive_archived_ex),
            "::",
            stringify!(root)
        )
    );
}
pub type GiNaC_archive_inv_at_cit = u8;
#[test]
fn bindgen_test_layout_GiNaC_archive() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_archive>(),
        168usize,
        concat!("Size of: ", stringify!(GiNaC_archive))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_archive>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_archive))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive>())).nodes as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive),
            "::",
            stringify!(nodes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive>())).exprs as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive),
            "::",
            stringify!(exprs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive>())).atoms as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive),
            "::",
            stringify!(atoms)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive>())).inverse_atoms as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive),
            "::",
            stringify!(inverse_atoms)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_archive>())).exprtable as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_archive),
            "::",
            stringify!(exprtable)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7archive10archive_exERKNS_2exEPKc"]
    pub fn GiNaC_archive_archive_ex(
        this: *mut GiNaC_archive,
        e: *const GiNaC_ex,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive12unarchive_exERKNS_9containerINSt7__cxx114listEEEPKc"]
    pub fn GiNaC_archive_unarchive_ex(
        this: *const GiNaC_archive,
        sym_lst: *const GiNaC_lst,
        name: *const ::std::os::raw::c_char,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive12unarchive_exERKNS_9containerINSt7__cxx114listEEEj"]
    pub fn GiNaC_archive_unarchive_ex1(
        this: *const GiNaC_archive,
        sym_lst: *const GiNaC_lst,
        index: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive12unarchive_exERKNS_9containerINSt7__cxx114listEEERNS2_12basic_stringIcSt11char_traitsIcESaIcEEEj"]
    pub fn GiNaC_archive_unarchive_ex2(
        this: *const GiNaC_archive,
        sym_lst: *const GiNaC_lst,
        name: *mut std_string,
        index: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive15num_expressionsEv"]
    pub fn GiNaC_archive_num_expressions(
        this: *const GiNaC_archive,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive12get_top_nodeEj"]
    pub fn GiNaC_archive_get_top_node(
        this: *const GiNaC_archive,
        index: ::std::os::raw::c_uint,
    ) -> *const GiNaC_archive_node;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7archive5clearEv"]
    pub fn GiNaC_archive_clear(this: *mut GiNaC_archive);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7archive8add_nodeERKNS_12archive_nodeE"]
    pub fn GiNaC_archive_add_node(
        this: *mut GiNaC_archive,
        n: *const GiNaC_archive_node,
    ) -> GiNaC_archive_node_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7archive8get_nodeEj"]
    pub fn GiNaC_archive_get_node(
        this: *mut GiNaC_archive,
        id: GiNaC_archive_node_id,
    ) -> *mut GiNaC_archive_node;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7archive6forgetEv"]
    pub fn GiNaC_archive_forget(this: *mut GiNaC_archive);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive8printrawERSo"]
    pub fn GiNaC_archive_printraw(
        this: *const GiNaC_archive,
        os: *mut std_ostream,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive7atomizeERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_archive_atomize(
        this: *const GiNaC_archive,
        s: *const std_string,
    ) -> GiNaC_archive_atom;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7archive9unatomizeB5cxx11Ej"]
    pub fn GiNaC_archive_unatomize(
        this: *const GiNaC_archive,
        id: GiNaC_archive_atom,
    ) -> *const std_string;
}
impl GiNaC_archive {
    #[inline]
    pub unsafe fn archive_ex(
        &mut self,
        e: *const GiNaC_ex,
        name: *const ::std::os::raw::c_char,
    ) {
        GiNaC_archive_archive_ex(self, e, name)
    }
    #[inline]
    pub unsafe fn unarchive_ex(
        &self,
        sym_lst: *const GiNaC_lst,
        name: *const ::std::os::raw::c_char,
    ) -> GiNaC_ex {
        GiNaC_archive_unarchive_ex(self, sym_lst, name)
    }
    #[inline]
    pub unsafe fn unarchive_ex1(
        &self,
        sym_lst: *const GiNaC_lst,
        index: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_archive_unarchive_ex1(self, sym_lst, index)
    }
    #[inline]
    pub unsafe fn unarchive_ex2(
        &self,
        sym_lst: *const GiNaC_lst,
        name: *mut std_string,
        index: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_archive_unarchive_ex2(self, sym_lst, name, index)
    }
    #[inline]
    pub unsafe fn num_expressions(&self) -> ::std::os::raw::c_uint {
        GiNaC_archive_num_expressions(self)
    }
    #[inline]
    pub unsafe fn get_top_node(
        &self,
        index: ::std::os::raw::c_uint,
    ) -> *const GiNaC_archive_node {
        GiNaC_archive_get_top_node(self, index)
    }
    #[inline]
    pub unsafe fn clear(&mut self) {
        GiNaC_archive_clear(self)
    }
    #[inline]
    pub unsafe fn add_node(
        &mut self,
        n: *const GiNaC_archive_node,
    ) -> GiNaC_archive_node_id {
        GiNaC_archive_add_node(self, n)
    }
    #[inline]
    pub unsafe fn get_node(
        &mut self,
        id: GiNaC_archive_node_id,
    ) -> *mut GiNaC_archive_node {
        GiNaC_archive_get_node(self, id)
    }
    #[inline]
    pub unsafe fn forget(&mut self) {
        GiNaC_archive_forget(self)
    }
    #[inline]
    pub unsafe fn printraw(&self, os: *mut std_ostream) {
        GiNaC_archive_printraw(self, os)
    }
    #[inline]
    pub unsafe fn atomize(&self, s: *const std_string) -> GiNaC_archive_atom {
        GiNaC_archive_atomize(self, s)
    }
    #[inline]
    pub unsafe fn unatomize(
        &self,
        id: GiNaC_archive_atom,
    ) -> *const std_string {
        GiNaC_archive_unatomize(self, id)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_container_storage {
    pub seq: GiNaC_container_storage_STLT,
}
pub type GiNaC_container_storage_STLT = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_container_init<STLT> {
    pub stlt: *mut STLT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<STLT>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_container {
    pub _base: GiNaC_basic,
    pub _base_1: GiNaC_container_storage,
}
#[repr(C)]
pub struct GiNaC_container_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_container_visitor {
    pub vtable_: *const GiNaC_container_visitor__bindgen_vtable,
}
pub type GiNaC_container_inherited = GiNaC_basic;
pub type GiNaC_container_STLT = GiNaC_container_storage;
pub type GiNaC_container_const_iterator = GiNaC_container_STLT;
pub type GiNaC_container_const_reverse_iterator = GiNaC_container_STLT;
extern "C" {
    #[link_name = "\u{1}reg_info"]
    pub static mut GiNaC_container_reg_info: GiNaC_registered_class_info;
}
extern "C" {
    #[link_name = "\u{1}prepend"]
    pub fn GiNaC_container_prepend(
        this: *mut GiNaC_container,
        b: *const GiNaC_ex,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}append"]
    pub fn GiNaC_container_append(
        this: *mut GiNaC_container,
        b: *const GiNaC_ex,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}remove_first"]
    pub fn GiNaC_container_remove_first(
        this: *mut GiNaC_container,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}remove_last"]
    pub fn GiNaC_container_remove_last(
        this: *mut GiNaC_container,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}remove_all"]
    pub fn GiNaC_container_remove_all(
        this: *mut GiNaC_container,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}sort"]
    pub fn GiNaC_container_sort(
        this: *mut GiNaC_container,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}unique"]
    pub fn GiNaC_container_unique(
        this: *mut GiNaC_container,
    ) -> *mut GiNaC_container;
}
extern "C" {
    #[link_name = "\u{1}do_print"]
    pub fn GiNaC_container_do_print(
        this: *const GiNaC_container,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}do_print_tree"]
    pub fn GiNaC_container_do_print_tree(
        this: *const GiNaC_container,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}do_print_python"]
    pub fn GiNaC_container_do_print_python(
        this: *const GiNaC_container,
        c: *const GiNaC_print_python,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}do_print_python_repr"]
    pub fn GiNaC_container_do_print_python_repr(
        this: *const GiNaC_container,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}subschildren"]
    pub fn GiNaC_container_subschildren(
        this: *const GiNaC_container,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_container_STLT;
}
impl GiNaC_container {
    #[inline]
    pub unsafe fn prepend(
        &mut self,
        b: *const GiNaC_ex,
    ) -> *mut GiNaC_container {
        GiNaC_container_prepend(self, b)
    }
    #[inline]
    pub unsafe fn append(
        &mut self,
        b: *const GiNaC_ex,
    ) -> *mut GiNaC_container {
        GiNaC_container_append(self, b)
    }
    #[inline]
    pub unsafe fn remove_first(&mut self) -> *mut GiNaC_container {
        GiNaC_container_remove_first(self)
    }
    #[inline]
    pub unsafe fn remove_last(&mut self) -> *mut GiNaC_container {
        GiNaC_container_remove_last(self)
    }
    #[inline]
    pub unsafe fn remove_all(&mut self) -> *mut GiNaC_container {
        GiNaC_container_remove_all(self)
    }
    #[inline]
    pub unsafe fn sort(&mut self) -> *mut GiNaC_container {
        GiNaC_container_sort(self)
    }
    #[inline]
    pub unsafe fn unique(&mut self) -> *mut GiNaC_container {
        GiNaC_container_unique(self)
    }
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_container_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_tree(
        &self,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_container_do_print_tree(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python(
        &self,
        c: *const GiNaC_print_python,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_container_do_print_python(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_container_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn subschildren(
        &self,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_container_STLT {
        GiNaC_container_subschildren(self, m, options)
    }
}
extern "C" {
    #[link_name = "\u{1}compare_same_type"]
    pub fn GiNaC_container_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}op"]
    pub fn GiNaC_container_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}let_op"]
    pub fn GiNaC_container_let_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> *mut GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}subs"]
    pub fn GiNaC_container_subs(
        this: *mut ::std::os::raw::c_void,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}is_equal_same_type"]
    pub fn GiNaC_container_is_equal_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}printseq"]
    pub fn GiNaC_container_printseq(
        this: *mut ::std::os::raw::c_void,
        c: *const GiNaC_print_context,
        openbracket: ::std::os::raw::c_char,
        delim: ::std::os::raw::c_char,
        closebracket: ::std::os::raw::c_char,
        this_precedence: ::std::os::raw::c_uint,
        upper_precedence: ::std::os::raw::c_uint,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_lst_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC14lst_unarchiver8usecountE"]
    pub static mut GiNaC_lst_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_lst_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_lst_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_lst_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_lst_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_lst_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC14lst_unarchiver6createEv"]
    pub fn GiNaC_lst_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC14lst_unarchiverC1Ev"]
    pub fn GiNaC_lst_unarchiver_lst_unarchiver(this: *mut GiNaC_lst_unarchiver);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC14lst_unarchiverD1Ev"]
    pub fn GiNaC_lst_unarchiver_lst_unarchiver_destructor(
        this: *mut GiNaC_lst_unarchiver,
    );
}
impl GiNaC_lst_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_lst_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_lst_unarchiver_lst_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_lst_unarchiver_lst_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL23lst_unarchiver_instanceE"]
    pub static mut GiNaC_lst_unarchiver_instance: GiNaC_lst_unarchiver;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_gcd_options {
    pub _address: u8,
}
pub const GiNaC_gcd_options_no_heur_gcd: GiNaC_gcd_options__bindgen_ty_1 = 2;
pub const GiNaC_gcd_options_no_part_factored: GiNaC_gcd_options__bindgen_ty_1 =
    4;
pub const GiNaC_gcd_options_use_sr_gcd: GiNaC_gcd_options__bindgen_ty_1 = 8;
pub type GiNaC_gcd_options__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_GiNaC_gcd_options() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_gcd_options>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_gcd_options))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_gcd_options>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_gcd_options))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3quoERKNS_2exES2_S2_b"]
    pub fn GiNaC_quo(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        x: *const GiNaC_ex,
        check_args: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3remERKNS_2exES2_S2_b"]
    pub fn GiNaC_rem(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        x: *const GiNaC_ex,
        check_args: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15decomp_rationalERKNS_2exES2_"]
    pub fn GiNaC_decomp_rational(
        a: *const GiNaC_ex,
        x: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4premERKNS_2exES2_S2_b"]
    pub fn GiNaC_prem(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        x: *const GiNaC_ex,
        check_args: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5spremERKNS_2exES2_S2_b"]
    pub fn GiNaC_sprem(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        x: *const GiNaC_ex,
        check_args: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6divideERKNS_2exES2_RS0_b"]
    pub fn GiNaC_divide(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        q: *mut GiNaC_ex,
        check_args: bool,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3gcdERKNS_2exES2_PS0_S3_bj"]
    pub fn GiNaC_gcd(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        ca: *mut GiNaC_ex,
        cb: *mut GiNaC_ex,
        check_args: bool,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3lcmERKNS_2exES2_b"]
    pub fn GiNaC_lcm(
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        check_args: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7sqrfreeERKNS_2exERKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_sqrfree(a: *const GiNaC_ex, l: *const GiNaC_lst) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15sqrfree_parfracERKNS_2exERKNS_6symbolE"]
    pub fn GiNaC_sqrfree_parfrac(
        a: *const GiNaC_ex,
        x: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC22collect_common_factorsERKNS_2exE"]
    pub fn GiNaC_collect_common_factors(e: *const GiNaC_ex) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9resultantERKNS_2exES2_S2_"]
    pub fn GiNaC_resultant(
        e1: *const GiNaC_ex,
        e2: *const GiNaC_ex,
        s: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
pub type GiNaC_evalffunctype =
    ::std::option::Option<unsafe extern "C" fn() -> GiNaC_ex>;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_constant {
    pub _base: GiNaC_basic,
    pub name: std_string,
    pub TeX_name: std_string,
    pub ef: GiNaC_evalffunctype,
    pub number: GiNaC_ex,
    pub serial: ::std::os::raw::c_uint,
    pub domain: ::std::os::raw::c_uint,
}
#[repr(C)]
pub struct GiNaC_constant_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_constant_visitor {
    pub vtable_: *const GiNaC_constant_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_constant_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_constant_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_constant_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_constant_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_constant_visitor))
    );
}
pub type GiNaC_constant_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8constant8reg_infoE"]
    pub static mut GiNaC_constant_reg_info: GiNaC_registered_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8constant11next_serialE"]
    pub static mut GiNaC_constant_next_serial: ::std::os::raw::c_uint;
}
#[test]
fn bindgen_test_layout_GiNaC_constant() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_constant>(),
        112usize,
        concat!("Size of: ", stringify!(GiNaC_constant))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_constant>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_constant))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_constant>())).name as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_constant),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_constant>())).TeX_name as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_constant),
            "::",
            stringify!(TeX_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_constant>())).ef as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_constant),
            "::",
            stringify!(ef)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_constant>())).number as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_constant),
            "::",
            stringify!(number)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_constant>())).serial as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_constant),
            "::",
            stringify!(serial)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_constant>())).domain as *const _
                as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_constant),
            "::",
            stringify!(domain)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_constant_do_print(
        this: *const GiNaC_constant,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant13do_print_treeERKNS_10print_treeEj"]
    pub fn GiNaC_constant_do_print_tree(
        this: *const GiNaC_constant,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_constant_do_print_latex(
        this: *const GiNaC_constant,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_constant_do_print_python_repr(
        this: *const GiNaC_constant,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8constantC1Ev"]
    pub fn GiNaC_constant_constant(this: *mut GiNaC_constant);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8constantC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEPFNS_2exEvES8_j"]
    pub fn GiNaC_constant_constant1(
        this: *mut GiNaC_constant,
        initname: *const std_string,
        efun: GiNaC_evalffunctype,
        texname: *const std_string,
        domain: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8constantC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERKNS_7numericES8_j"]
    pub fn GiNaC_constant_constant2(
        this: *mut GiNaC_constant,
        initname: *const std_string,
        initnumber: *const GiNaC_numeric,
        texname: *const std_string,
        domain: ::std::os::raw::c_uint,
    );
}
impl GiNaC_constant {
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_constant_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_tree(
        &self,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_constant_do_print_tree(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_constant_do_print_latex(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_constant_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_constant_constant(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        initname: *const std_string,
        efun: GiNaC_evalffunctype,
        texname: *const std_string,
        domain: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_constant_constant1(
            __bindgen_tmp.as_mut_ptr(),
            initname,
            efun,
            texname,
            domain,
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        initname: *const std_string,
        initnumber: *const GiNaC_numeric,
        texname: *const std_string,
        domain: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_constant_constant2(
            __bindgen_tmp.as_mut_ptr(),
            initname,
            initnumber,
            texname,
            domain,
        );
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_constant_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant4infoEj"]
    pub fn GiNaC_constant_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant5evalfEv"]
    pub fn GiNaC_constant_evalf(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant13is_polynomialERKNS_2exE"]
    pub fn GiNaC_constant_is_polynomial(
        this: *mut ::std::os::raw::c_void,
        var: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant9conjugateEv"]
    pub fn GiNaC_constant_conjugate(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant9real_partEv"]
    pub fn GiNaC_constant_real_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant9imag_partEv"]
    pub fn GiNaC_constant_imag_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_constant_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8constant12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_constant_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant10derivativeERKNS_6symbolE"]
    pub fn GiNaC_constant_derivative(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant18is_equal_same_typeERKNS_5basicE"]
    pub fn GiNaC_constant_is_equal_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8constant8calchashEv"]
    pub fn GiNaC_constant_calchash(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_constant_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19constant_unarchiver8usecountE"]
    pub static mut GiNaC_constant_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_constant_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_constant_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_constant_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_constant_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_constant_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19constant_unarchiver6createEv"]
    pub fn GiNaC_constant_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19constant_unarchiverC1Ev"]
    pub fn GiNaC_constant_unarchiver_constant_unarchiver(
        this: *mut GiNaC_constant_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19constant_unarchiverD1Ev"]
    pub fn GiNaC_constant_unarchiver_constant_unarchiver_destructor(
        this: *mut GiNaC_constant_unarchiver,
    );
}
impl GiNaC_constant_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_constant_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_constant_unarchiver_constant_unarchiver(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_constant_unarchiver_constant_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL28constant_unarchiver_instanceE"]
    pub static mut GiNaC_constant_unarchiver_instance:
        GiNaC_constant_unarchiver;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC2PiE"]
    pub static GiNaC_Pi: GiNaC_constant;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7CatalanE"]
    pub static GiNaC_Catalan: GiNaC_constant;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5EulerE"]
    pub static GiNaC_Euler: GiNaC_constant;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_fail {
    pub _base: GiNaC_basic,
}
#[repr(C)]
pub struct GiNaC_fail_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_fail_visitor {
    pub vtable_: *const GiNaC_fail_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_fail_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_fail_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_fail_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_fail_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_fail_visitor))
    );
}
pub type GiNaC_fail_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4fail8reg_infoE"]
    pub static mut GiNaC_fail_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_fail() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_fail>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_fail))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_fail>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_fail))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC4fail8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_fail_do_print(
        this: *const GiNaC_fail,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4failC1Ev"]
    pub fn GiNaC_fail_fail(this: *mut GiNaC_fail);
}
impl GiNaC_fail {
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_fail_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_fail_fail(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC4fail17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_fail_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_fail_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15fail_unarchiver8usecountE"]
    pub static mut GiNaC_fail_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_fail_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_fail_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_fail_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_fail_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_fail_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15fail_unarchiver6createEv"]
    pub fn GiNaC_fail_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15fail_unarchiverC1Ev"]
    pub fn GiNaC_fail_unarchiver_fail_unarchiver(
        this: *mut GiNaC_fail_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15fail_unarchiverD1Ev"]
    pub fn GiNaC_fail_unarchiver_fail_unarchiver_destructor(
        this: *mut GiNaC_fail_unarchiver,
    );
}
impl GiNaC_fail_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_fail_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_fail_unarchiver_fail_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_fail_unarchiver_fail_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL24fail_unarchiver_instanceE"]
    pub static mut GiNaC_fail_unarchiver_instance: GiNaC_fail_unarchiver;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_integral {
    pub _base: GiNaC_basic,
    pub x: GiNaC_ex,
    pub a: GiNaC_ex,
    pub b: GiNaC_ex,
    pub f: GiNaC_ex,
}
#[repr(C)]
pub struct GiNaC_integral_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_integral_visitor {
    pub vtable_: *const GiNaC_integral_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_integral_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_integral_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_integral_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_integral_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_integral_visitor))
    );
}
pub type GiNaC_integral_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integral8reg_infoE"]
    pub static mut GiNaC_integral_reg_info: GiNaC_registered_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integral21max_integration_levelE"]
    pub static mut GiNaC_integral_max_integration_level: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integral26relative_integration_errorE"]
    pub static mut GiNaC_integral_relative_integration_error: GiNaC_ex;
}
#[test]
fn bindgen_test_layout_GiNaC_integral() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_integral>(),
        56usize,
        concat!("Size of: ", stringify!(GiNaC_integral))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_integral>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_integral))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_integral>())).x as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_integral),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_integral>())).a as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_integral),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_integral>())).b as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_integral),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_integral>())).f as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_integral),
            "::",
            stringify!(f)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_integral_do_print(
        this: *const GiNaC_integral,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_integral_do_print_latex(
        this: *const GiNaC_integral,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integralC1Ev"]
    pub fn GiNaC_integral_integral(this: *mut GiNaC_integral);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integralC1ERKNS_2exES3_S3_S3_"]
    pub fn GiNaC_integral_integral1(
        this: *mut GiNaC_integral,
        x_: *const GiNaC_ex,
        a_: *const GiNaC_ex,
        b_: *const GiNaC_ex,
        f_: *const GiNaC_ex,
    );
}
impl GiNaC_integral {
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_integral_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_integral_do_print_latex(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_integral_integral(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        x_: *const GiNaC_ex,
        a_: *const GiNaC_ex,
        b_: *const GiNaC_ex,
        f_: *const GiNaC_ex,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_integral_integral1(__bindgen_tmp.as_mut_ptr(), x_, a_, b_, f_);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_integral_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral4evalEv"]
    pub fn GiNaC_integral_eval(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral5evalfEv"]
    pub fn GiNaC_integral_evalf(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral6degreeERKNS_2exE"]
    pub fn GiNaC_integral_degree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral7ldegreeERKNS_2exE"]
    pub fn GiNaC_integral_ldegree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral10eval_ncmulERKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_integral_eval_ncmul(
        this: *mut ::std::os::raw::c_void,
        v: *const GiNaC_exvector,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral4nopsEv"]
    pub fn GiNaC_integral_nops(this: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral2opEm"]
    pub fn GiNaC_integral_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integral6let_opEm"]
    pub fn GiNaC_integral_let_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> *mut GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral6expandEj"]
    pub fn GiNaC_integral_expand(
        this: *mut ::std::os::raw::c_void,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral16get_free_indicesEv"]
    pub fn GiNaC_integral_get_free_indices(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral11return_typeEv"]
    pub fn GiNaC_integral_return_type(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral17return_type_tinfoEv"]
    pub fn GiNaC_integral_return_type_tinfo(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_return_type_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral9conjugateEv"]
    pub fn GiNaC_integral_conjugate(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral10eval_integEv"]
    pub fn GiNaC_integral_eval_integ(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_integral_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8integral12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_integral_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral10derivativeERKNS_6symbolE"]
    pub fn GiNaC_integral_derivative(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8integral6seriesERKNS_10relationalEij"]
    pub fn GiNaC_integral_series(
        this: *mut ::std::os::raw::c_void,
        r: *const GiNaC_relational,
        order: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_integral_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19integral_unarchiver8usecountE"]
    pub static mut GiNaC_integral_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_integral_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_integral_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_integral_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_integral_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_integral_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19integral_unarchiver6createEv"]
    pub fn GiNaC_integral_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19integral_unarchiverC1Ev"]
    pub fn GiNaC_integral_unarchiver_integral_unarchiver(
        this: *mut GiNaC_integral_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19integral_unarchiverD1Ev"]
    pub fn GiNaC_integral_unarchiver_integral_unarchiver_destructor(
        this: *mut GiNaC_integral_unarchiver,
    );
}
impl GiNaC_integral_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_integral_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_integral_unarchiver_integral_unarchiver(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_integral_unarchiver_integral_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL28integral_unarchiver_instanceE"]
    pub static mut GiNaC_integral_unarchiver_instance:
        GiNaC_integral_unarchiver;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15adaptivesimpsonERKNS_2exES2_S2_S2_S2_"]
    pub fn GiNaC_adaptivesimpson(
        x: *const GiNaC_ex,
        a: *const GiNaC_ex,
        b: *const GiNaC_ex,
        f: *const GiNaC_ex,
        error: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_matrix_init<It> {
    pub iter: It,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<It>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_matrix {
    pub _base: GiNaC_basic,
    pub row: ::std::os::raw::c_uint,
    pub col: ::std::os::raw::c_uint,
    pub m: GiNaC_exvector,
}
#[repr(C)]
pub struct GiNaC_matrix_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_matrix_visitor {
    pub vtable_: *const GiNaC_matrix_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_matrix_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_matrix_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_matrix_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_matrix_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_matrix_visitor))
    );
}
pub type GiNaC_matrix_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix8reg_infoE"]
    pub static mut GiNaC_matrix_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_matrix() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_matrix>(),
        56usize,
        concat!("Size of: ", stringify!(GiNaC_matrix))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_matrix>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_matrix))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_matrix>())).row as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_matrix),
            "::",
            stringify!(row)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_matrix>())).col as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_matrix),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_matrix>())).m as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_matrix),
            "::",
            stringify!(m)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix3addERKS0_"]
    pub fn GiNaC_matrix_add(
        this: *const GiNaC_matrix,
        other: *const GiNaC_matrix,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix3subERKS0_"]
    pub fn GiNaC_matrix_sub(
        this: *const GiNaC_matrix,
        other: *const GiNaC_matrix,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix3mulERKS0_"]
    pub fn GiNaC_matrix_mul(
        this: *const GiNaC_matrix,
        other: *const GiNaC_matrix,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix3mulERKNS_7numericE"]
    pub fn GiNaC_matrix_mul1(
        this: *const GiNaC_matrix,
        other: *const GiNaC_numeric,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix10mul_scalarERKNS_2exE"]
    pub fn GiNaC_matrix_mul_scalar(
        this: *const GiNaC_matrix,
        other: *const GiNaC_ex,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix3powERKNS_2exE"]
    pub fn GiNaC_matrix_pow(
        this: *const GiNaC_matrix,
        expn: *const GiNaC_ex,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix9transposeEv"]
    pub fn GiNaC_matrix_transpose(this: *const GiNaC_matrix) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix11determinantEj"]
    pub fn GiNaC_matrix_determinant(
        this: *const GiNaC_matrix,
        algo: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix5traceEv"]
    pub fn GiNaC_matrix_trace(this: *const GiNaC_matrix) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix8charpolyERKNS_2exE"]
    pub fn GiNaC_matrix_charpoly(
        this: *const GiNaC_matrix,
        lambda: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix7inverseEv"]
    pub fn GiNaC_matrix_inverse(this: *const GiNaC_matrix) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix7inverseEj"]
    pub fn GiNaC_matrix_inverse1(
        this: *const GiNaC_matrix,
        algo: ::std::os::raw::c_uint,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix5solveERKS0_S2_j"]
    pub fn GiNaC_matrix_solve(
        this: *const GiNaC_matrix,
        vars: *const GiNaC_matrix,
        rhs: *const GiNaC_matrix,
        algo: ::std::os::raw::c_uint,
    ) -> GiNaC_matrix;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix4rankEv"]
    pub fn GiNaC_matrix_rank(
        this: *const GiNaC_matrix,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix4rankEj"]
    pub fn GiNaC_matrix_rank1(
        this: *const GiNaC_matrix,
        solve_algo: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix14is_zero_matrixEv"]
    pub fn GiNaC_matrix_is_zero_matrix(this: *const GiNaC_matrix) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix17determinant_minorEv"]
    pub fn GiNaC_matrix_determinant_minor(
        this: *const GiNaC_matrix,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix12echelon_formEji"]
    pub fn GiNaC_matrix_echelon_form(
        this: *mut GiNaC_matrix,
        algo: ::std::os::raw::c_uint,
        n: ::std::os::raw::c_int,
    ) -> u8;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix17gauss_eliminationEb"]
    pub fn GiNaC_matrix_gauss_elimination(
        this: *mut GiNaC_matrix,
        det: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix25division_free_eliminationEb"]
    pub fn GiNaC_matrix_division_free_elimination(
        this: *mut GiNaC_matrix,
        det: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix25fraction_free_eliminationEb"]
    pub fn GiNaC_matrix_fraction_free_elimination(
        this: *mut GiNaC_matrix,
        det: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix21markowitz_eliminationEj"]
    pub fn GiNaC_matrix_markowitz_elimination(
        this: *mut GiNaC_matrix,
        n: ::std::os::raw::c_uint,
    ) -> u8;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix5pivotEjjb"]
    pub fn GiNaC_matrix_pivot(
        this: *mut GiNaC_matrix,
        ro: ::std::os::raw::c_uint,
        co: ::std::os::raw::c_uint,
        symbolic: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix14print_elementsERKNS_13print_contextEPKcS5_S5_S5_"]
    pub fn GiNaC_matrix_print_elements(
        this: *const GiNaC_matrix,
        c: *const GiNaC_print_context,
        row_start: *const ::std::os::raw::c_char,
        row_end: *const ::std::os::raw::c_char,
        row_sep: *const ::std::os::raw::c_char,
        col_sep: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_matrix_do_print(
        this: *const GiNaC_matrix,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_matrix_do_print_latex(
        this: *const GiNaC_matrix,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_matrix_do_print_python_repr(
        this: *const GiNaC_matrix,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrixC1Ev"]
    pub fn GiNaC_matrix_matrix(this: *mut GiNaC_matrix);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrixC1Ejj"]
    pub fn GiNaC_matrix_matrix1(
        this: *mut GiNaC_matrix,
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrixC1EjjRKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_matrix_matrix2(
        this: *mut GiNaC_matrix,
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        l: *const GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrixC1ESt16initializer_listIS1_INS_2exEEE"]
    pub fn GiNaC_matrix_matrix3(this: *mut GiNaC_matrix, l: [u64; 2usize]);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrixC1EjjRKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_matrix_matrix4(
        this: *mut GiNaC_matrix,
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        m2: *const GiNaC_exvector,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrixC1EjjOSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_matrix_matrix5(
        this: *mut GiNaC_matrix,
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        m2: *mut GiNaC_exvector,
    );
}
impl GiNaC_matrix {
    #[inline]
    pub unsafe fn add(&self, other: *const GiNaC_matrix) -> GiNaC_matrix {
        GiNaC_matrix_add(self, other)
    }
    #[inline]
    pub unsafe fn sub(&self, other: *const GiNaC_matrix) -> GiNaC_matrix {
        GiNaC_matrix_sub(self, other)
    }
    #[inline]
    pub unsafe fn mul(&self, other: *const GiNaC_matrix) -> GiNaC_matrix {
        GiNaC_matrix_mul(self, other)
    }
    #[inline]
    pub unsafe fn mul1(&self, other: *const GiNaC_numeric) -> GiNaC_matrix {
        GiNaC_matrix_mul1(self, other)
    }
    #[inline]
    pub unsafe fn mul_scalar(&self, other: *const GiNaC_ex) -> GiNaC_matrix {
        GiNaC_matrix_mul_scalar(self, other)
    }
    #[inline]
    pub unsafe fn pow(&self, expn: *const GiNaC_ex) -> GiNaC_matrix {
        GiNaC_matrix_pow(self, expn)
    }
    #[inline]
    pub unsafe fn transpose(&self) -> GiNaC_matrix {
        GiNaC_matrix_transpose(self)
    }
    #[inline]
    pub unsafe fn determinant(&self, algo: ::std::os::raw::c_uint) -> GiNaC_ex {
        GiNaC_matrix_determinant(self, algo)
    }
    #[inline]
    pub unsafe fn trace(&self) -> GiNaC_ex {
        GiNaC_matrix_trace(self)
    }
    #[inline]
    pub unsafe fn charpoly(&self, lambda: *const GiNaC_ex) -> GiNaC_ex {
        GiNaC_matrix_charpoly(self, lambda)
    }
    #[inline]
    pub unsafe fn inverse(&self) -> GiNaC_matrix {
        GiNaC_matrix_inverse(self)
    }
    #[inline]
    pub unsafe fn inverse1(
        &self,
        algo: ::std::os::raw::c_uint,
    ) -> GiNaC_matrix {
        GiNaC_matrix_inverse1(self, algo)
    }
    #[inline]
    pub unsafe fn solve(
        &self,
        vars: *const GiNaC_matrix,
        rhs: *const GiNaC_matrix,
        algo: ::std::os::raw::c_uint,
    ) -> GiNaC_matrix {
        GiNaC_matrix_solve(self, vars, rhs, algo)
    }
    #[inline]
    pub unsafe fn rank(&self) -> ::std::os::raw::c_uint {
        GiNaC_matrix_rank(self)
    }
    #[inline]
    pub unsafe fn rank1(
        &self,
        solve_algo: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint {
        GiNaC_matrix_rank1(self, solve_algo)
    }
    #[inline]
    pub unsafe fn is_zero_matrix(&self) -> bool {
        GiNaC_matrix_is_zero_matrix(self)
    }
    #[inline]
    pub unsafe fn determinant_minor(&self) -> GiNaC_ex {
        GiNaC_matrix_determinant_minor(self)
    }
    #[inline]
    pub unsafe fn echelon_form(
        &mut self,
        algo: ::std::os::raw::c_uint,
        n: ::std::os::raw::c_int,
    ) -> u8 {
        GiNaC_matrix_echelon_form(self, algo, n)
    }
    #[inline]
    pub unsafe fn gauss_elimination(
        &mut self,
        det: bool,
    ) -> ::std::os::raw::c_int {
        GiNaC_matrix_gauss_elimination(self, det)
    }
    #[inline]
    pub unsafe fn division_free_elimination(
        &mut self,
        det: bool,
    ) -> ::std::os::raw::c_int {
        GiNaC_matrix_division_free_elimination(self, det)
    }
    #[inline]
    pub unsafe fn fraction_free_elimination(
        &mut self,
        det: bool,
    ) -> ::std::os::raw::c_int {
        GiNaC_matrix_fraction_free_elimination(self, det)
    }
    #[inline]
    pub unsafe fn markowitz_elimination(
        &mut self,
        n: ::std::os::raw::c_uint,
    ) -> u8 {
        GiNaC_matrix_markowitz_elimination(self, n)
    }
    #[inline]
    pub unsafe fn pivot(
        &mut self,
        ro: ::std::os::raw::c_uint,
        co: ::std::os::raw::c_uint,
        symbolic: bool,
    ) -> ::std::os::raw::c_int {
        GiNaC_matrix_pivot(self, ro, co, symbolic)
    }
    #[inline]
    pub unsafe fn print_elements(
        &self,
        c: *const GiNaC_print_context,
        row_start: *const ::std::os::raw::c_char,
        row_end: *const ::std::os::raw::c_char,
        row_sep: *const ::std::os::raw::c_char,
        col_sep: *const ::std::os::raw::c_char,
    ) {
        GiNaC_matrix_print_elements(
            self, c, row_start, row_end, row_sep, col_sep,
        )
    }
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_matrix_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_matrix_do_print_latex(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_matrix_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_matrix(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_matrix1(__bindgen_tmp.as_mut_ptr(), r, c);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        l: *const GiNaC_lst,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_matrix2(__bindgen_tmp.as_mut_ptr(), r, c, l);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(l: [u64; 2usize]) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_matrix3(__bindgen_tmp.as_mut_ptr(), l);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        m2: *const GiNaC_exvector,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_matrix4(__bindgen_tmp.as_mut_ptr(), r, c, m2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        m2: *mut GiNaC_exvector,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_matrix5(__bindgen_tmp.as_mut_ptr(), r, c, m2);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_matrix_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix4nopsEv"]
    pub fn GiNaC_matrix_nops(this: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix2opEm"]
    pub fn GiNaC_matrix_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix6let_opEm"]
    pub fn GiNaC_matrix_let_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> *mut GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix4subsERKSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEEj"]
    pub fn GiNaC_matrix_subs(
        this: *mut ::std::os::raw::c_void,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix12eval_indexedERKNS_5basicE"]
    pub fn GiNaC_matrix_eval_indexed(
        this: *mut ::std::os::raw::c_void,
        i: *const GiNaC_basic,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix11add_indexedERKNS_2exES3_"]
    pub fn GiNaC_matrix_add_indexed(
        this: *mut ::std::os::raw::c_void,
        self_: *const GiNaC_ex,
        other: *const GiNaC_ex,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix18scalar_mul_indexedERKNS_2exERKNS_7numericE"]
    pub fn GiNaC_matrix_scalar_mul_indexed(
        this: *mut ::std::os::raw::c_void,
        self_: *const GiNaC_ex,
        other: *const GiNaC_numeric,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix13contract_withEN9__gnu_cxx17__normal_iteratorIPNS_2exESt6vectorIS3_SaIS3_EEEES8_RS7_"]
    pub fn GiNaC_matrix_contract_with(
        this: *mut ::std::os::raw::c_void,
        self_: __gnu_cxx___normal_iterator<pointer>,
        other: __gnu_cxx___normal_iterator<pointer>,
        v: *mut GiNaC_exvector,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix9conjugateEv"]
    pub fn GiNaC_matrix_conjugate(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix9real_partEv"]
    pub fn GiNaC_matrix_real_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix9imag_partEv"]
    pub fn GiNaC_matrix_imag_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_matrix_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6matrix12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_matrix_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6matrix15match_same_typeERKNS_5basicE"]
    pub fn GiNaC_matrix_match_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_matrix_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17matrix_unarchiver8usecountE"]
    pub static mut GiNaC_matrix_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_matrix_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_matrix_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_matrix_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_matrix_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_matrix_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17matrix_unarchiver6createEv"]
    pub fn GiNaC_matrix_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17matrix_unarchiverC1Ev"]
    pub fn GiNaC_matrix_unarchiver_matrix_unarchiver(
        this: *mut GiNaC_matrix_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17matrix_unarchiverD1Ev"]
    pub fn GiNaC_matrix_unarchiver_matrix_unarchiver_destructor(
        this: *mut GiNaC_matrix_unarchiver,
    );
}
impl GiNaC_matrix_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_matrix_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_matrix_unarchiver_matrix_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_matrix_unarchiver_matrix_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL26matrix_unarchiver_instanceE"]
    pub static mut GiNaC_matrix_unarchiver_instance: GiNaC_matrix_unarchiver;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC13lst_to_matrixERKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_lst_to_matrix(l: *const GiNaC_lst) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11diag_matrixERKNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_diag_matrix(l: *const GiNaC_lst) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11diag_matrixESt16initializer_listINS_2exEE"]
    pub fn GiNaC_diag_matrix1(l: [u64; 2usize]) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11unit_matrixEjj"]
    pub fn GiNaC_unit_matrix(
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15symbolic_matrixEjjRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES7_"]
    pub fn GiNaC_symbolic_matrix(
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        base_name: *const std_string,
        tex_base_name: *const std_string,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC14reduced_matrixERKNS_6matrixEjj"]
    pub fn GiNaC_reduced_matrix(
        m: *const GiNaC_matrix,
        r: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10sub_matrixERKNS_6matrixEjjjj"]
    pub fn GiNaC_sub_matrix(
        m: *const GiNaC_matrix,
        r: ::std::os::raw::c_uint,
        nr: ::std::os::raw::c_uint,
        c: ::std::os::raw::c_uint,
        nc: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
pub type GiNaC_digits_changed_callback =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_long)>;
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC__numeric_digits {
    pub digits: ::std::os::raw::c_long,
    pub callbacklist: [u64; 3usize],
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15_numeric_digits8too_lateE"]
    pub static mut GiNaC__numeric_digits_too_late: bool;
}
#[test]
fn bindgen_test_layout_GiNaC__numeric_digits() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC__numeric_digits>(),
        32usize,
        concat!("Size of: ", stringify!(GiNaC__numeric_digits))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC__numeric_digits>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC__numeric_digits))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC__numeric_digits>())).digits as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC__numeric_digits),
            "::",
            stringify!(digits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC__numeric_digits>())).callbacklist
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC__numeric_digits),
            "::",
            stringify!(callbacklist)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC15_numeric_digits5printERSo"]
    pub fn GiNaC__numeric_digits_print(
        this: *const GiNaC__numeric_digits,
        os: *mut std_ostream,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15_numeric_digits12add_callbackEPFvlE"]
    pub fn GiNaC__numeric_digits_add_callback(
        this: *mut GiNaC__numeric_digits,
        callback: GiNaC_digits_changed_callback,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15_numeric_digitsC1Ev"]
    pub fn GiNaC__numeric_digits__numeric_digits(
        this: *mut GiNaC__numeric_digits,
    );
}
impl GiNaC__numeric_digits {
    #[inline]
    pub unsafe fn print(&self, os: *mut std_ostream) {
        GiNaC__numeric_digits_print(self, os)
    }
    #[inline]
    pub unsafe fn add_callback(
        &mut self,
        callback: GiNaC_digits_changed_callback,
    ) {
        GiNaC__numeric_digits_add_callback(self, callback)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC__numeric_digits__numeric_digits(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_pole_error {
    pub _base: std_domain_error,
    pub deg: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GiNaC_pole_error() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_pole_error>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_pole_error))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_pole_error>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_pole_error))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_pole_error>())).deg as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_pole_error),
            "::",
            stringify!(deg)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10pole_error6degreeEv"]
    pub fn GiNaC_pole_error_degree(
        this: *const GiNaC_pole_error,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10pole_errorC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEi"]
    pub fn GiNaC_pole_error_pole_error(
        this: *mut GiNaC_pole_error,
        what_arg: *const std_string,
        degree: ::std::os::raw::c_int,
    );
}
impl GiNaC_pole_error {
    #[inline]
    pub unsafe fn degree(&self) -> ::std::os::raw::c_int {
        GiNaC_pole_error_degree(self)
    }
    #[inline]
    pub unsafe fn new(
        what_arg: *const std_string,
        degree: ::std::os::raw::c_int,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_pole_error_pole_error(
            __bindgen_tmp.as_mut_ptr(),
            what_arg,
            degree,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
pub struct GiNaC_numeric {
    pub _base: GiNaC_basic,
    pub value: cln_cl_N,
}
#[repr(C)]
pub struct GiNaC_numeric_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_numeric_visitor {
    pub vtable_: *const GiNaC_numeric_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_numeric_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_numeric_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_numeric_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_numeric_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_numeric_visitor))
    );
}
pub type GiNaC_numeric_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numeric8reg_infoE"]
    pub static mut GiNaC_numeric_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_numeric() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_numeric>(),
        32usize,
        concat!("Size of: ", stringify!(GiNaC_numeric))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_numeric>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_numeric))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_numeric>())).value as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_numeric),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric3addERKS0_"]
    pub fn GiNaC_numeric_add(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric3subERKS0_"]
    pub fn GiNaC_numeric_sub(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric3mulERKS0_"]
    pub fn GiNaC_numeric_mul(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric3divERKS0_"]
    pub fn GiNaC_numeric_div(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric5powerERKS0_"]
    pub fn GiNaC_numeric_power(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7add_dynERKS0_"]
    pub fn GiNaC_numeric_add_dyn(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7sub_dynERKS0_"]
    pub fn GiNaC_numeric_sub_dyn(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7mul_dynERKS0_"]
    pub fn GiNaC_numeric_mul_dyn(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7div_dynERKS0_"]
    pub fn GiNaC_numeric_div_dyn(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric9power_dynERKS0_"]
    pub fn GiNaC_numeric_power_dyn(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7inverseEv"]
    pub fn GiNaC_numeric_inverse(this: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4stepEv"]
    pub fn GiNaC_numeric_step(this: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4csgnEv"]
    pub fn GiNaC_numeric_csgn(
        this: *const GiNaC_numeric,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7compareERKS0_"]
    pub fn GiNaC_numeric_compare(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric8is_equalERKS0_"]
    pub fn GiNaC_numeric_is_equal(
        this: *const GiNaC_numeric,
        other: *const GiNaC_numeric,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7is_zeroEv"]
    pub fn GiNaC_numeric_is_zero(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric11is_positiveEv"]
    pub fn GiNaC_numeric_is_positive(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric11is_negativeEv"]
    pub fn GiNaC_numeric_is_negative(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric10is_integerEv"]
    pub fn GiNaC_numeric_is_integer(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric14is_pos_integerEv"]
    pub fn GiNaC_numeric_is_pos_integer(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric17is_nonneg_integerEv"]
    pub fn GiNaC_numeric_is_nonneg_integer(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7is_evenEv"]
    pub fn GiNaC_numeric_is_even(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric6is_oddEv"]
    pub fn GiNaC_numeric_is_odd(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric8is_primeEv"]
    pub fn GiNaC_numeric_is_prime(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric11is_rationalEv"]
    pub fn GiNaC_numeric_is_rational(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7is_realEv"]
    pub fn GiNaC_numeric_is_real(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric11is_cintegerEv"]
    pub fn GiNaC_numeric_is_cinteger(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric12is_crationalEv"]
    pub fn GiNaC_numeric_is_crational(this: *const GiNaC_numeric) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric6to_intEv"]
    pub fn GiNaC_numeric_to_int(
        this: *const GiNaC_numeric,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7to_longEv"]
    pub fn GiNaC_numeric_to_long(
        this: *const GiNaC_numeric,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric9to_doubleEv"]
    pub fn GiNaC_numeric_to_double(this: *const GiNaC_numeric) -> f64;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7to_cl_NEv"]
    pub fn GiNaC_numeric_to_cl_N(this: *const GiNaC_numeric) -> cln_cl_N;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4realEv"]
    pub fn GiNaC_numeric_real(this: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4imagEv"]
    pub fn GiNaC_numeric_imag(this: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric5numerEv"]
    pub fn GiNaC_numeric_numer(this: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric5denomEv"]
    pub fn GiNaC_numeric_denom(this: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric10int_lengthEv"]
    pub fn GiNaC_numeric_int_length(
        this: *const GiNaC_numeric,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric13print_numericERKNS_13print_contextEPKcS5_S5_S5_j"]
    pub fn GiNaC_numeric_print_numeric(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_context,
        par_open: *const ::std::os::raw::c_char,
        par_close: *const ::std::os::raw::c_char,
        imag_sym: *const ::std::os::raw::c_char,
        mul_sym: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_numeric_do_print(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_numeric_do_print_latex(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric13do_print_csrcERKNS_10print_csrcEj"]
    pub fn GiNaC_numeric_do_print_csrc(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_csrc,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric18do_print_csrc_cl_NERKNS_15print_csrc_cl_NEj"]
    pub fn GiNaC_numeric_do_print_csrc_cl_N(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_csrc_cl_N,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric13do_print_treeERKNS_10print_treeEj"]
    pub fn GiNaC_numeric_do_print_tree(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_numeric_do_print_python_repr(
        this: *const GiNaC_numeric,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ev"]
    pub fn GiNaC_numeric_numeric(this: *mut GiNaC_numeric);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ei"]
    pub fn GiNaC_numeric_numeric1(
        this: *mut GiNaC_numeric,
        i: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ej"]
    pub fn GiNaC_numeric_numeric2(
        this: *mut GiNaC_numeric,
        i: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1El"]
    pub fn GiNaC_numeric_numeric3(
        this: *mut GiNaC_numeric,
        i: ::std::os::raw::c_long,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Em"]
    pub fn GiNaC_numeric_numeric4(
        this: *mut GiNaC_numeric,
        i: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ex"]
    pub fn GiNaC_numeric_numeric5(
        this: *mut GiNaC_numeric,
        i: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ey"]
    pub fn GiNaC_numeric_numeric6(
        this: *mut GiNaC_numeric,
        i: ::std::os::raw::c_ulonglong,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ell"]
    pub fn GiNaC_numeric_numeric7(
        this: *mut GiNaC_numeric,
        numer: ::std::os::raw::c_long,
        denom: ::std::os::raw::c_long,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1Ed"]
    pub fn GiNaC_numeric_numeric8(this: *mut GiNaC_numeric, d: f64);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1EPKc"]
    pub fn GiNaC_numeric_numeric9(
        this: *mut GiNaC_numeric,
        arg1: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numericC1ERKN3cln4cl_NE"]
    pub fn GiNaC_numeric_numeric10(
        this: *mut GiNaC_numeric,
        z: *const cln_cl_N,
    );
}
impl GiNaC_numeric {
    #[inline]
    pub unsafe fn add(&self, other: *const GiNaC_numeric) -> GiNaC_numeric {
        GiNaC_numeric_add(self, other)
    }
    #[inline]
    pub unsafe fn sub(&self, other: *const GiNaC_numeric) -> GiNaC_numeric {
        GiNaC_numeric_sub(self, other)
    }
    #[inline]
    pub unsafe fn mul(&self, other: *const GiNaC_numeric) -> GiNaC_numeric {
        GiNaC_numeric_mul(self, other)
    }
    #[inline]
    pub unsafe fn div(&self, other: *const GiNaC_numeric) -> GiNaC_numeric {
        GiNaC_numeric_div(self, other)
    }
    #[inline]
    pub unsafe fn power(&self, other: *const GiNaC_numeric) -> GiNaC_numeric {
        GiNaC_numeric_power(self, other)
    }
    #[inline]
    pub unsafe fn add_dyn(
        &self,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric {
        GiNaC_numeric_add_dyn(self, other)
    }
    #[inline]
    pub unsafe fn sub_dyn(
        &self,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric {
        GiNaC_numeric_sub_dyn(self, other)
    }
    #[inline]
    pub unsafe fn mul_dyn(
        &self,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric {
        GiNaC_numeric_mul_dyn(self, other)
    }
    #[inline]
    pub unsafe fn div_dyn(
        &self,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric {
        GiNaC_numeric_div_dyn(self, other)
    }
    #[inline]
    pub unsafe fn power_dyn(
        &self,
        other: *const GiNaC_numeric,
    ) -> *const GiNaC_numeric {
        GiNaC_numeric_power_dyn(self, other)
    }
    #[inline]
    pub unsafe fn inverse(&self) -> GiNaC_numeric {
        GiNaC_numeric_inverse(self)
    }
    #[inline]
    pub unsafe fn step(&self) -> GiNaC_numeric {
        GiNaC_numeric_step(self)
    }
    #[inline]
    pub unsafe fn csgn(&self) -> ::std::os::raw::c_int {
        GiNaC_numeric_csgn(self)
    }
    #[inline]
    pub unsafe fn compare(
        &self,
        other: *const GiNaC_numeric,
    ) -> ::std::os::raw::c_int {
        GiNaC_numeric_compare(self, other)
    }
    #[inline]
    pub unsafe fn is_equal(&self, other: *const GiNaC_numeric) -> bool {
        GiNaC_numeric_is_equal(self, other)
    }
    #[inline]
    pub unsafe fn is_zero(&self) -> bool {
        GiNaC_numeric_is_zero(self)
    }
    #[inline]
    pub unsafe fn is_positive(&self) -> bool {
        GiNaC_numeric_is_positive(self)
    }
    #[inline]
    pub unsafe fn is_negative(&self) -> bool {
        GiNaC_numeric_is_negative(self)
    }
    #[inline]
    pub unsafe fn is_integer(&self) -> bool {
        GiNaC_numeric_is_integer(self)
    }
    #[inline]
    pub unsafe fn is_pos_integer(&self) -> bool {
        GiNaC_numeric_is_pos_integer(self)
    }
    #[inline]
    pub unsafe fn is_nonneg_integer(&self) -> bool {
        GiNaC_numeric_is_nonneg_integer(self)
    }
    #[inline]
    pub unsafe fn is_even(&self) -> bool {
        GiNaC_numeric_is_even(self)
    }
    #[inline]
    pub unsafe fn is_odd(&self) -> bool {
        GiNaC_numeric_is_odd(self)
    }
    #[inline]
    pub unsafe fn is_prime(&self) -> bool {
        GiNaC_numeric_is_prime(self)
    }
    #[inline]
    pub unsafe fn is_rational(&self) -> bool {
        GiNaC_numeric_is_rational(self)
    }
    #[inline]
    pub unsafe fn is_real(&self) -> bool {
        GiNaC_numeric_is_real(self)
    }
    #[inline]
    pub unsafe fn is_cinteger(&self) -> bool {
        GiNaC_numeric_is_cinteger(self)
    }
    #[inline]
    pub unsafe fn is_crational(&self) -> bool {
        GiNaC_numeric_is_crational(self)
    }
    #[inline]
    pub unsafe fn to_int(&self) -> ::std::os::raw::c_int {
        GiNaC_numeric_to_int(self)
    }
    #[inline]
    pub unsafe fn to_long(&self) -> ::std::os::raw::c_long {
        GiNaC_numeric_to_long(self)
    }
    #[inline]
    pub unsafe fn to_double(&self) -> f64 {
        GiNaC_numeric_to_double(self)
    }
    #[inline]
    pub unsafe fn to_cl_N(&self) -> cln_cl_N {
        GiNaC_numeric_to_cl_N(self)
    }
    #[inline]
    pub unsafe fn real(&self) -> GiNaC_numeric {
        GiNaC_numeric_real(self)
    }
    #[inline]
    pub unsafe fn imag(&self) -> GiNaC_numeric {
        GiNaC_numeric_imag(self)
    }
    #[inline]
    pub unsafe fn numer(&self) -> GiNaC_numeric {
        GiNaC_numeric_numer(self)
    }
    #[inline]
    pub unsafe fn denom(&self) -> GiNaC_numeric {
        GiNaC_numeric_denom(self)
    }
    #[inline]
    pub unsafe fn int_length(&self) -> ::std::os::raw::c_int {
        GiNaC_numeric_int_length(self)
    }
    #[inline]
    pub unsafe fn print_numeric(
        &self,
        c: *const GiNaC_print_context,
        par_open: *const ::std::os::raw::c_char,
        par_close: *const ::std::os::raw::c_char,
        imag_sym: *const ::std::os::raw::c_char,
        mul_sym: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_print_numeric(
            self, c, par_open, par_close, imag_sym, mul_sym, level,
        )
    }
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_do_print_latex(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_csrc(
        &self,
        c: *const GiNaC_print_csrc,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_do_print_csrc(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_csrc_cl_N(
        &self,
        c: *const GiNaC_print_csrc_cl_N,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_do_print_csrc_cl_N(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_tree(
        &self,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_do_print_tree(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_numeric_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(i: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric1(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(i: ::std::os::raw::c_uint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric2(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(i: ::std::os::raw::c_long) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric3(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(i: ::std::os::raw::c_ulong) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric4(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(i: ::std::os::raw::c_longlong) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric5(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(i: ::std::os::raw::c_ulonglong) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric6(__bindgen_tmp.as_mut_ptr(), i);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new7(
        numer: ::std::os::raw::c_long,
        denom: ::std::os::raw::c_long,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric7(__bindgen_tmp.as_mut_ptr(), numer, denom);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new8(d: f64) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric8(__bindgen_tmp.as_mut_ptr(), d);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new9(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric9(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new10(z: *const cln_cl_N) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_numeric10(__bindgen_tmp.as_mut_ptr(), z);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_numeric_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4infoEj"]
    pub fn GiNaC_numeric_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric13is_polynomialERKNS_2exE"]
    pub fn GiNaC_numeric_is_polynomial(
        this: *mut ::std::os::raw::c_void,
        var: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric6degreeERKNS_2exE"]
    pub fn GiNaC_numeric_degree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7ldegreeERKNS_2exE"]
    pub fn GiNaC_numeric_ldegree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric5coeffERKNS_2exEi"]
    pub fn GiNaC_numeric_coeff(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
        n: ::std::os::raw::c_int,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric3hasERKNS_2exEj"]
    pub fn GiNaC_numeric_has(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4evalEv"]
    pub fn GiNaC_numeric_eval(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric5evalfEv"]
    pub fn GiNaC_numeric_evalf(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric6normalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEES9_"]
    pub fn GiNaC_numeric_normal(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
        rev_lookup: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric11to_rationalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_numeric_to_rational(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric13to_polynomialERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_numeric_to_polynomial(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric15integer_contentEv"]
    pub fn GiNaC_numeric_integer_content(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric4smodERKS0_"]
    pub fn GiNaC_numeric_smod(
        this: *mut ::std::os::raw::c_void,
        xi: *const GiNaC_numeric,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric15max_coefficientEv"]
    pub fn GiNaC_numeric_max_coefficient(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric9conjugateEv"]
    pub fn GiNaC_numeric_conjugate(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric9real_partEv"]
    pub fn GiNaC_numeric_real_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric9imag_partEv"]
    pub fn GiNaC_numeric_imag_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_numeric_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7numeric12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_numeric_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric18is_equal_same_typeERKNS_5basicE"]
    pub fn GiNaC_numeric_is_equal_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7numeric8calchashEv"]
    pub fn GiNaC_numeric_calchash(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_numeric_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC18numeric_unarchiver8usecountE"]
    pub static mut GiNaC_numeric_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_numeric_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_numeric_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_numeric_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_numeric_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_numeric_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC18numeric_unarchiver6createEv"]
    pub fn GiNaC_numeric_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC18numeric_unarchiverC1Ev"]
    pub fn GiNaC_numeric_unarchiver_numeric_unarchiver(
        this: *mut GiNaC_numeric_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC18numeric_unarchiverD1Ev"]
    pub fn GiNaC_numeric_unarchiver_numeric_unarchiver_destructor(
        this: *mut GiNaC_numeric_unarchiver,
    );
}
impl GiNaC_numeric_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_numeric_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_numeric_unarchiver_numeric_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_numeric_unarchiver_numeric_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL27numeric_unarchiver_instanceE"]
    pub static mut GiNaC_numeric_unarchiver_instance: GiNaC_numeric_unarchiver;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC1IE"]
    pub static GiNaC_I: GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6DigitsE"]
    pub static mut GiNaC_Digits: GiNaC__numeric_digits;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3expERKNS_7numericE"]
    pub fn GiNaC_exp(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3logERKNS_7numericE"]
    pub fn GiNaC_log(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3sinERKNS_7numericE"]
    pub fn GiNaC_sin(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3cosERKNS_7numericE"]
    pub fn GiNaC_cos(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3tanERKNS_7numericE"]
    pub fn GiNaC_tan(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4asinERKNS_7numericE"]
    pub fn GiNaC_asin(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4acosERKNS_7numericE"]
    pub fn GiNaC_acos(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4atanERKNS_7numericE"]
    pub fn GiNaC_atan(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4atanERKNS_7numericES2_"]
    pub fn GiNaC_atan1(
        y: *const GiNaC_numeric,
        x: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4sinhERKNS_7numericE"]
    pub fn GiNaC_sinh(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4coshERKNS_7numericE"]
    pub fn GiNaC_cosh(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4tanhERKNS_7numericE"]
    pub fn GiNaC_tanh(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5asinhERKNS_7numericE"]
    pub fn GiNaC_asinh(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5acoshERKNS_7numericE"]
    pub fn GiNaC_acosh(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5atanhERKNS_7numericE"]
    pub fn GiNaC_atanh(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3Li2ERKNS_7numericE"]
    pub fn GiNaC_Li2(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4zetaERKNS_7numericE"]
    pub fn GiNaC_zeta(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6lgammaERKNS_7numericE"]
    pub fn GiNaC_lgamma(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6tgammaERKNS_7numericE"]
    pub fn GiNaC_tgamma(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3psiERKNS_7numericE"]
    pub fn GiNaC_psi(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3psiERKNS_7numericES2_"]
    pub fn GiNaC_psi1(
        n: *const GiNaC_numeric,
        x: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9factorialERKNS_7numericE"]
    pub fn GiNaC_factorial(n: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC15doublefactorialERKNS_7numericE"]
    pub fn GiNaC_doublefactorial(n: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8binomialERKNS_7numericES2_"]
    pub fn GiNaC_binomial(
        n: *const GiNaC_numeric,
        k: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9bernoulliERKNS_7numericE"]
    pub fn GiNaC_bernoulli(n: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9fibonacciERKNS_7numericE"]
    pub fn GiNaC_fibonacci(n: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5isqrtERKNS_7numericE"]
    pub fn GiNaC_isqrt(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4sqrtERKNS_7numericE"]
    pub fn GiNaC_sqrt(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3absERKNS_7numericE"]
    pub fn GiNaC_abs(x: *const GiNaC_numeric) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3modERKNS_7numericES2_"]
    pub fn GiNaC_mod(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4smodERKNS_7numericES2_"]
    pub fn GiNaC_smod(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4iremERKNS_7numericES2_"]
    pub fn GiNaC_irem(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4iremERKNS_7numericES2_RS0_"]
    pub fn GiNaC_irem1(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
        q: *mut GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4iquoERKNS_7numericES2_"]
    pub fn GiNaC_iquo(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4iquoERKNS_7numericES2_RS0_"]
    pub fn GiNaC_iquo1(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
        r: *mut GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3gcdERKNS_7numericES2_"]
    pub fn GiNaC_gcd1(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC3lcmERKNS_7numericES2_"]
    pub fn GiNaC_lcm1(
        a: *const GiNaC_numeric,
        b: *const GiNaC_numeric,
    ) -> GiNaC_numeric;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7PiEvalfEv"]
    pub fn GiNaC_PiEvalf() -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10EulerEvalfEv"]
    pub fn GiNaC_EulerEvalf() -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12CatalanEvalfEv"]
    pub fn GiNaC_CatalanEvalf() -> GiNaC_ex;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_power {
    pub _base: GiNaC_basic,
    pub basis: GiNaC_ex,
    pub exponent: GiNaC_ex,
}
#[repr(C)]
pub struct GiNaC_power_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_power_visitor {
    pub vtable_: *const GiNaC_power_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_power_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_power_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_power_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_power_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_power_visitor))
    );
}
pub type GiNaC_power_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5power8reg_infoE"]
    pub static mut GiNaC_power_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_power() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_power>(),
        40usize,
        concat!("Size of: ", stringify!(GiNaC_power))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_power>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_power))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_power>())).basis as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_power),
            "::",
            stringify!(basis)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_power>())).exponent as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_power),
            "::",
            stringify!(exponent)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power11print_powerERKNS_13print_contextEPKcS5_S5_j"]
    pub fn GiNaC_power_print_power(
        this: *const GiNaC_power,
        c: *const GiNaC_print_context,
        powersymbol: *const ::std::os::raw::c_char,
        openbrace: *const ::std::os::raw::c_char,
        closebrace: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power13do_print_dfltERKNS_10print_dfltEj"]
    pub fn GiNaC_power_do_print_dflt(
        this: *const GiNaC_power,
        c: *const GiNaC_print_dflt,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_power_do_print_latex(
        this: *const GiNaC_power,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power13do_print_csrcERKNS_10print_csrcEj"]
    pub fn GiNaC_power_do_print_csrc(
        this: *const GiNaC_power,
        c: *const GiNaC_print_csrc,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power15do_print_pythonERKNS_12print_pythonEj"]
    pub fn GiNaC_power_do_print_python(
        this: *const GiNaC_power,
        c: *const GiNaC_print_python,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_power_do_print_python_repr(
        this: *const GiNaC_power,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power18do_print_csrc_cl_NERKNS_15print_csrc_cl_NEj"]
    pub fn GiNaC_power_do_print_csrc_cl_N(
        this: *const GiNaC_power,
        c: *const GiNaC_print_csrc_cl_N,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5power10expand_addERKNS_3addElj"]
    pub fn GiNaC_power_expand_add(
        a: *const GiNaC_add,
        n: ::std::os::raw::c_long,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5power12expand_add_2ERKNS_3addEj"]
    pub fn GiNaC_power_expand_add_2(
        a: *const GiNaC_add,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5power10expand_mulERKNS_3mulERKNS_7numericEjb"]
    pub fn GiNaC_power_expand_mul(
        m: *const GiNaC_mul,
        n: *const GiNaC_numeric,
        options: ::std::os::raw::c_uint,
        from_expand: bool,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5powerC1Ev"]
    pub fn GiNaC_power_power(this: *mut GiNaC_power);
}
impl GiNaC_power {
    #[inline]
    pub unsafe fn print_power(
        &self,
        c: *const GiNaC_print_context,
        powersymbol: *const ::std::os::raw::c_char,
        openbrace: *const ::std::os::raw::c_char,
        closebrace: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_print_power(
            self,
            c,
            powersymbol,
            openbrace,
            closebrace,
            level,
        )
    }
    #[inline]
    pub unsafe fn do_print_dflt(
        &self,
        c: *const GiNaC_print_dflt,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_do_print_dflt(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_do_print_latex(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_csrc(
        &self,
        c: *const GiNaC_print_csrc,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_do_print_csrc(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python(
        &self,
        c: *const GiNaC_print_python,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_do_print_python(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_csrc_cl_N(
        &self,
        c: *const GiNaC_print_csrc_cl_N,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_power_do_print_csrc_cl_N(self, c, level)
    }
    #[inline]
    pub unsafe fn expand_add(
        a: *const GiNaC_add,
        n: ::std::os::raw::c_long,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_power_expand_add(a, n, options)
    }
    #[inline]
    pub unsafe fn expand_add_2(
        a: *const GiNaC_add,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex {
        GiNaC_power_expand_add_2(a, options)
    }
    #[inline]
    pub unsafe fn expand_mul(
        m: *const GiNaC_mul,
        n: *const GiNaC_numeric,
        options: ::std::os::raw::c_uint,
        from_expand: bool,
    ) -> GiNaC_ex {
        GiNaC_power_expand_mul(m, n, options, from_expand)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_power_power(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_power_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power4infoEj"]
    pub fn GiNaC_power_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power4nopsEv"]
    pub fn GiNaC_power_nops(this: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power2opEm"]
    pub fn GiNaC_power_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power3mapERNS_12map_functionE"]
    pub fn GiNaC_power_map(
        this: *mut ::std::os::raw::c_void,
        f: *mut GiNaC_map_function,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power13is_polynomialERKNS_2exE"]
    pub fn GiNaC_power_is_polynomial(
        this: *mut ::std::os::raw::c_void,
        var: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power6degreeERKNS_2exE"]
    pub fn GiNaC_power_degree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power7ldegreeERKNS_2exE"]
    pub fn GiNaC_power_ldegree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power5coeffERKNS_2exEi"]
    pub fn GiNaC_power_coeff(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
        n: ::std::os::raw::c_int,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power4evalEv"]
    pub fn GiNaC_power_eval(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power5evalfEv"]
    pub fn GiNaC_power_evalf(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power5evalmEv"]
    pub fn GiNaC_power_evalm(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power6seriesERKNS_10relationalEij"]
    pub fn GiNaC_power_series(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_relational,
        order: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power4subsERKSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEEj"]
    pub fn GiNaC_power_subs(
        this: *mut ::std::os::raw::c_void,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power3hasERKNS_2exEj"]
    pub fn GiNaC_power_has(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_ex,
        options: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power6normalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEES9_"]
    pub fn GiNaC_power_normal(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
        rev_lookup: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power11to_rationalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_power_to_rational(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power13to_polynomialERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_power_to_polynomial(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power9conjugateEv"]
    pub fn GiNaC_power_conjugate(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power9real_partEv"]
    pub fn GiNaC_power_real_part(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power9imag_partEv"]
    pub fn GiNaC_power_imag_part(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_power_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5power12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_power_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power10derivativeERKNS_6symbolE"]
    pub fn GiNaC_power_derivative(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power10eval_ncmulERKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_power_eval_ncmul(
        this: *mut ::std::os::raw::c_void,
        v: *const GiNaC_exvector,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power11return_typeEv"]
    pub fn GiNaC_power_return_type(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power17return_type_tinfoEv"]
    pub fn GiNaC_power_return_type_tinfo(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_return_type_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5power6expandEj"]
    pub fn GiNaC_power_expand(
        this: *mut ::std::os::raw::c_void,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_power_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16power_unarchiver8usecountE"]
    pub static mut GiNaC_power_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_power_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_power_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_power_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_power_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_power_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16power_unarchiver6createEv"]
    pub fn GiNaC_power_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16power_unarchiverC1Ev"]
    pub fn GiNaC_power_unarchiver_power_unarchiver(
        this: *mut GiNaC_power_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16power_unarchiverD1Ev"]
    pub fn GiNaC_power_unarchiver_power_unarchiver_destructor(
        this: *mut GiNaC_power_unarchiver,
    );
}
impl GiNaC_power_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_power_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_power_unarchiver_power_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_power_unarchiver_power_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL25power_unarchiver_instanceE"]
    pub static mut GiNaC_power_unarchiver_instance: GiNaC_power_unarchiver;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_relational {
    pub _base: GiNaC_basic,
    pub lh: GiNaC_ex,
    pub rh: GiNaC_ex,
    pub o: GiNaC_relational_operators,
}
#[repr(C)]
pub struct GiNaC_relational_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_relational_visitor {
    pub vtable_: *const GiNaC_relational_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_relational_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_relational_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_relational_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_relational_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_relational_visitor))
    );
}
pub type GiNaC_relational_inherited = GiNaC_basic;
pub const GiNaC_relational_operators_equal: GiNaC_relational_operators = 0;
pub const GiNaC_relational_operators_not_equal: GiNaC_relational_operators = 1;
pub const GiNaC_relational_operators_less: GiNaC_relational_operators = 2;
pub const GiNaC_relational_operators_less_or_equal: GiNaC_relational_operators =
    3;
pub const GiNaC_relational_operators_greater: GiNaC_relational_operators = 4;
pub const GiNaC_relational_operators_greater_or_equal:
    GiNaC_relational_operators = 5;
pub type GiNaC_relational_operators = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_relational_safe_bool_helper {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_relational_safe_bool_helper() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_relational_safe_bool_helper>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_relational_safe_bool_helper))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_relational_safe_bool_helper>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(GiNaC_relational_safe_bool_helper)
        )
    );
}
pub type GiNaC_relational_safe_bool =
    ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10relational8reg_infoE"]
    pub static mut GiNaC_relational_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_relational() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_relational>(),
        48usize,
        concat!("Size of: ", stringify!(GiNaC_relational))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_relational>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_relational))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_relational>())).lh as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_relational),
            "::",
            stringify!(lh)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_relational>())).rh as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_relational),
            "::",
            stringify!(rh)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_relational>())).o as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_relational),
            "::",
            stringify!(o)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_relational_do_print(
        this: *const GiNaC_relational,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_relational_do_print_python_repr(
        this: *const GiNaC_relational,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10relationalC1Ev"]
    pub fn GiNaC_relational_relational(this: *mut GiNaC_relational);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10relationalC1ERKNS_2exES3_NS0_9operatorsE"]
    pub fn GiNaC_relational_relational1(
        this: *mut GiNaC_relational,
        lhs: *const GiNaC_ex,
        rhs: *const GiNaC_ex,
        oper: GiNaC_relational_operators,
    );
}
impl GiNaC_relational {
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_relational_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_relational_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_relational_relational(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        lhs: *const GiNaC_ex,
        rhs: *const GiNaC_ex,
        oper: GiNaC_relational_operators,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_relational_relational1(
            __bindgen_tmp.as_mut_ptr(),
            lhs,
            rhs,
            oper,
        );
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_relational_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational4infoEj"]
    pub fn GiNaC_relational_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational4nopsEv"]
    pub fn GiNaC_relational_nops(this: *mut ::std::os::raw::c_void) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational2opEm"]
    pub fn GiNaC_relational_op(
        this: *mut ::std::os::raw::c_void,
        i: size_t,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational3mapERNS_12map_functionE"]
    pub fn GiNaC_relational_map(
        this: *mut ::std::os::raw::c_void,
        f: *mut GiNaC_map_function,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational4subsERKSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEEj"]
    pub fn GiNaC_relational_subs(
        this: *mut ::std::os::raw::c_void,
        m: *const GiNaC_exmap,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_relational_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10relational12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_relational_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational10eval_ncmulERKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_relational_eval_ncmul(
        this: *mut ::std::os::raw::c_void,
        v: *const GiNaC_exvector,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational15match_same_typeERKNS_5basicE"]
    pub fn GiNaC_relational_match_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational11return_typeEv"]
    pub fn GiNaC_relational_return_type(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational17return_type_tinfoEv"]
    pub fn GiNaC_relational_return_type_tinfo(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_return_type_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC10relational8calchashEv"]
    pub fn GiNaC_relational_calchash(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_relational_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21relational_unarchiver8usecountE"]
    pub static mut GiNaC_relational_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_relational_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_relational_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_relational_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_relational_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_relational_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21relational_unarchiver6createEv"]
    pub fn GiNaC_relational_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21relational_unarchiverC1Ev"]
    pub fn GiNaC_relational_unarchiver_relational_unarchiver(
        this: *mut GiNaC_relational_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21relational_unarchiverD1Ev"]
    pub fn GiNaC_relational_unarchiver_relational_unarchiver_destructor(
        this: *mut GiNaC_relational_unarchiver,
    );
}
impl GiNaC_relational_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_relational_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_relational_unarchiver_relational_unarchiver(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_relational_unarchiver_relational_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL30relational_unarchiver_instanceE"]
    pub static mut GiNaC_relational_unarchiver_instance:
        GiNaC_relational_unarchiver;
}
pub type GiNaC_exprseq = [u64; 6usize];
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_ncmul {
    pub _base: GiNaC_exprseq,
}
#[repr(C)]
pub struct GiNaC_ncmul_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_ncmul_visitor {
    pub vtable_: *const GiNaC_ncmul_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_ncmul_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ncmul_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_ncmul_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ncmul_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_ncmul_visitor))
    );
}
pub type GiNaC_ncmul_inherited = GiNaC_exprseq;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmul8reg_infoE"]
    pub static mut GiNaC_ncmul_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_ncmul() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ncmul>(),
        48usize,
        concat!("Size of: ", stringify!(GiNaC_ncmul))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ncmul>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_ncmul))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_ncmul_do_print(
        this: *const GiNaC_ncmul,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul13do_print_csrcERKNS_13print_contextEj"]
    pub fn GiNaC_ncmul_do_print_csrc(
        this: *const GiNaC_ncmul,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul13count_factorsERKNS_2exE"]
    pub fn GiNaC_ncmul_count_factors(
        this: *const GiNaC_ncmul,
        e: *const GiNaC_ex,
    ) -> size_t;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul14append_factorsERSt6vectorINS_2exESaIS2_EERKS2_"]
    pub fn GiNaC_ncmul_append_factors(
        this: *const GiNaC_ncmul,
        v: *mut GiNaC_exvector,
        e: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul14expandchildrenEj"]
    pub fn GiNaC_ncmul_expandchildren(
        this: *const GiNaC_ncmul,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul11get_factorsEv"]
    pub fn GiNaC_ncmul_get_factors(
        this: *const GiNaC_ncmul,
    ) -> *const GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1Ev"]
    pub fn GiNaC_ncmul_ncmul(this: *mut GiNaC_ncmul);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1ERKNS_2exES3_"]
    pub fn GiNaC_ncmul_ncmul1(
        this: *mut GiNaC_ncmul,
        lh: *const GiNaC_ex,
        rh: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1ERKNS_2exES3_S3_"]
    pub fn GiNaC_ncmul_ncmul2(
        this: *mut GiNaC_ncmul,
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1ERKNS_2exES3_S3_S3_"]
    pub fn GiNaC_ncmul_ncmul3(
        this: *mut GiNaC_ncmul,
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
        f4: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1ERKNS_2exES3_S3_S3_S3_"]
    pub fn GiNaC_ncmul_ncmul4(
        this: *mut GiNaC_ncmul,
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
        f4: *const GiNaC_ex,
        f5: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1ERKNS_2exES3_S3_S3_S3_S3_"]
    pub fn GiNaC_ncmul_ncmul5(
        this: *mut GiNaC_ncmul,
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
        f4: *const GiNaC_ex,
        f5: *const GiNaC_ex,
        f6: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1ERKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_ncmul_ncmul6(this: *mut GiNaC_ncmul, v: *const GiNaC_exvector);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5ncmulC1EOSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_ncmul_ncmul7(this: *mut GiNaC_ncmul, v: *mut GiNaC_exvector);
}
impl GiNaC_ncmul {
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_ncmul_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_csrc(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_ncmul_do_print_csrc(self, c, level)
    }
    #[inline]
    pub unsafe fn count_factors(&self, e: *const GiNaC_ex) -> size_t {
        GiNaC_ncmul_count_factors(self, e)
    }
    #[inline]
    pub unsafe fn append_factors(
        &self,
        v: *mut GiNaC_exvector,
        e: *const GiNaC_ex,
    ) {
        GiNaC_ncmul_append_factors(self, v, e)
    }
    #[inline]
    pub unsafe fn expandchildren(
        &self,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_exvector {
        GiNaC_ncmul_expandchildren(self, options)
    }
    #[inline]
    pub unsafe fn get_factors(&self) -> *const GiNaC_exvector {
        GiNaC_ncmul_get_factors(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(lh: *const GiNaC_ex, rh: *const GiNaC_ex) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul1(__bindgen_tmp.as_mut_ptr(), lh, rh);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul2(__bindgen_tmp.as_mut_ptr(), f1, f2, f3);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
        f4: *const GiNaC_ex,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul3(__bindgen_tmp.as_mut_ptr(), f1, f2, f3, f4);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
        f4: *const GiNaC_ex,
        f5: *const GiNaC_ex,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul4(__bindgen_tmp.as_mut_ptr(), f1, f2, f3, f4, f5);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(
        f1: *const GiNaC_ex,
        f2: *const GiNaC_ex,
        f3: *const GiNaC_ex,
        f4: *const GiNaC_ex,
        f5: *const GiNaC_ex,
        f6: *const GiNaC_ex,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul5(__bindgen_tmp.as_mut_ptr(), f1, f2, f3, f4, f5, f6);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(v: *const GiNaC_exvector) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul6(__bindgen_tmp.as_mut_ptr(), v);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new7(v: *mut GiNaC_exvector) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_ncmul7(__bindgen_tmp.as_mut_ptr(), v);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_ncmul_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul4infoEj"]
    pub fn GiNaC_ncmul_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul6degreeERKNS_2exE"]
    pub fn GiNaC_ncmul_degree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul7ldegreeERKNS_2exE"]
    pub fn GiNaC_ncmul_ldegree(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul6expandEj"]
    pub fn GiNaC_ncmul_expand(
        this: *mut ::std::os::raw::c_void,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul5coeffERKNS_2exEi"]
    pub fn GiNaC_ncmul_coeff(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_ex,
        n: ::std::os::raw::c_int,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul4evalEv"]
    pub fn GiNaC_ncmul_eval(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul5evalmEv"]
    pub fn GiNaC_ncmul_evalm(this: *mut ::std::os::raw::c_void) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul16get_free_indicesEv"]
    pub fn GiNaC_ncmul_get_free_indices(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul13thiscontainerERKSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_ncmul_thiscontainer(
        this: *mut ::std::os::raw::c_void,
        v: *const GiNaC_exvector,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul13thiscontainerEOSt6vectorINS_2exESaIS2_EE"]
    pub fn GiNaC_ncmul_thiscontainer1(
        this: *mut ::std::os::raw::c_void,
        v: *mut GiNaC_exvector,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul9conjugateEv"]
    pub fn GiNaC_ncmul_conjugate(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul9real_partEv"]
    pub fn GiNaC_ncmul_real_part(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul9imag_partEv"]
    pub fn GiNaC_ncmul_imag_part(this: *mut ::std::os::raw::c_void)
        -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul10derivativeERKNS_6symbolE"]
    pub fn GiNaC_ncmul_derivative(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul11return_typeEv"]
    pub fn GiNaC_ncmul_return_type(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC5ncmul17return_type_tinfoEv"]
    pub fn GiNaC_ncmul_return_type_tinfo(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_return_type_t;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_ncmul_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16ncmul_unarchiver8usecountE"]
    pub static mut GiNaC_ncmul_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_ncmul_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_ncmul_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_ncmul_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_ncmul_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_ncmul_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16ncmul_unarchiver6createEv"]
    pub fn GiNaC_ncmul_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16ncmul_unarchiverC1Ev"]
    pub fn GiNaC_ncmul_unarchiver_ncmul_unarchiver(
        this: *mut GiNaC_ncmul_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16ncmul_unarchiverD1Ev"]
    pub fn GiNaC_ncmul_unarchiver_ncmul_unarchiver_destructor(
        this: *mut GiNaC_ncmul_unarchiver,
    );
}
impl GiNaC_ncmul_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_ncmul_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_ncmul_unarchiver_ncmul_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_ncmul_unarchiver_ncmul_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL25ncmul_unarchiver_instanceE"]
    pub static mut GiNaC_ncmul_unarchiver_instance: GiNaC_ncmul_unarchiver;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC12reeval_ncmulERKSt6vectorINS_2exESaIS1_EE"]
    pub fn GiNaC_reeval_ncmul(v: *const GiNaC_exvector) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10hold_ncmulERKSt6vectorINS_2exESaIS1_EE"]
    pub fn GiNaC_hold_ncmul(v: *const GiNaC_exvector) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4dfltERSo"]
    pub fn GiNaC_dflt(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC5latexERSo"]
    pub fn GiNaC_latex(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6pythonERSo"]
    pub fn GiNaC_python(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11python_reprERSo"]
    pub fn GiNaC_python_repr(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4treeERSo"]
    pub fn GiNaC_tree(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC4csrcERSo"]
    pub fn GiNaC_csrc(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10csrc_floatERSo"]
    pub fn GiNaC_csrc_float(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC11csrc_doubleERSo"]
    pub fn GiNaC_csrc_double(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9csrc_cl_NERSo"]
    pub fn GiNaC_csrc_cl_N(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC16index_dimensionsERSo"]
    pub fn GiNaC_index_dimensions(os: *mut std_ostream) -> *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19no_index_dimensionsERSo"]
    pub fn GiNaC_no_index_dimensions(os: *mut std_ostream) -> *mut std_ostream;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_compare_all_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_compare_std_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_compare_bitwise {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_structure<T> {
    pub _base: GiNaC_basic,
    pub obj: T,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
pub struct GiNaC_structure_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_structure_visitor {
    pub vtable_: *const GiNaC_structure_visitor__bindgen_vtable,
}
pub type GiNaC_structure_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}reg_info"]
    pub static mut GiNaC_reg_info: GiNaC_registered_class_info;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_symbol {
    pub _base: GiNaC_basic,
    pub serial: ::std::os::raw::c_uint,
    pub name: std_string,
    pub TeX_name: std_string,
}
#[repr(C)]
pub struct GiNaC_symbol_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_symbol_visitor {
    pub vtable_: *const GiNaC_symbol_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_symbol_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_symbol_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_symbol_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_symbol_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_symbol_visitor))
    );
}
pub type GiNaC_symbol_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6symbol8reg_infoE"]
    pub static mut GiNaC_symbol_reg_info: GiNaC_registered_class_info;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6symbol11next_serialE"]
    pub static mut GiNaC_symbol_next_serial: ::std::os::raw::c_uint;
}
#[test]
fn bindgen_test_layout_GiNaC_symbol() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_symbol>(),
        88usize,
        concat!("Size of: ", stringify!(GiNaC_symbol))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_symbol>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_symbol))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_symbol>())).serial as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_symbol),
            "::",
            stringify!(serial)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_symbol>())).name as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_symbol),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_symbol>())).TeX_name as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_symbol),
            "::",
            stringify!(TeX_name)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol8get_nameB5cxx11Ev"]
    pub fn GiNaC_symbol_get_name(this: *const GiNaC_symbol) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol12get_TeX_nameB5cxx11Ev"]
    pub fn GiNaC_symbol_get_TeX_name(this: *const GiNaC_symbol) -> std_string;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_symbol_do_print(
        this: *const GiNaC_symbol,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_symbol_do_print_latex(
        this: *const GiNaC_symbol,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol13do_print_treeERKNS_10print_treeEj"]
    pub fn GiNaC_symbol_do_print_tree(
        this: *const GiNaC_symbol,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_symbol_do_print_python_repr(
        this: *const GiNaC_symbol,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6symbolC1Ev"]
    pub fn GiNaC_symbol_symbol(this: *mut GiNaC_symbol);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6symbolC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_symbol_symbol1(
        this: *mut GiNaC_symbol,
        initname: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6symbolC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
    pub fn GiNaC_symbol_symbol2(
        this: *mut GiNaC_symbol,
        initname: *const std_string,
        texname: *const std_string,
    );
}
impl GiNaC_symbol {
    #[inline]
    pub unsafe fn get_name(&self) -> std_string {
        GiNaC_symbol_get_name(self)
    }
    #[inline]
    pub unsafe fn get_TeX_name(&self) -> std_string {
        GiNaC_symbol_get_TeX_name(self)
    }
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_symbol_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_symbol_do_print_latex(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_tree(
        &self,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_symbol_do_print_tree(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_symbol_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_symbol_symbol(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(initname: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_symbol_symbol1(__bindgen_tmp.as_mut_ptr(), initname);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        initname: *const std_string,
        texname: *const std_string,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_symbol_symbol2(__bindgen_tmp.as_mut_ptr(), initname, texname);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_symbol_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol4infoEj"]
    pub fn GiNaC_symbol_info(
        this: *mut ::std::os::raw::c_void,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol6seriesERKNS_10relationalEij"]
    pub fn GiNaC_symbol_series(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_relational,
        order: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol6normalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEES9_"]
    pub fn GiNaC_symbol_normal(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
        rev_lookup: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol11to_rationalERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_symbol_to_rational(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol13to_polynomialERSt3mapINS_2exES2_NS_10ex_is_lessESaISt4pairIKS2_S2_EEE"]
    pub fn GiNaC_symbol_to_polynomial(
        this: *mut ::std::os::raw::c_void,
        repl: *mut GiNaC_exmap,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol9conjugateEv"]
    pub fn GiNaC_symbol_conjugate(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol9real_partEv"]
    pub fn GiNaC_symbol_real_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol9imag_partEv"]
    pub fn GiNaC_symbol_imag_part(
        this: *mut ::std::os::raw::c_void,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol13is_polynomialERKNS_2exE"]
    pub fn GiNaC_symbol_is_polynomial(
        this: *mut ::std::os::raw::c_void,
        var: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_symbol_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC6symbol12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_symbol_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol10derivativeERKS0_"]
    pub fn GiNaC_symbol_derivative(
        this: *mut ::std::os::raw::c_void,
        s: *const GiNaC_symbol,
    ) -> GiNaC_ex;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol18is_equal_same_typeERKNS_5basicE"]
    pub fn GiNaC_symbol_is_equal_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6symbol8calchashEv"]
    pub fn GiNaC_symbol_calchash(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_symbol_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17symbol_unarchiver8usecountE"]
    pub static mut GiNaC_symbol_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_symbol_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_symbol_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_symbol_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_symbol_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_symbol_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17symbol_unarchiver6createEv"]
    pub fn GiNaC_symbol_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17symbol_unarchiverC1Ev"]
    pub fn GiNaC_symbol_unarchiver_symbol_unarchiver(
        this: *mut GiNaC_symbol_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC17symbol_unarchiverD1Ev"]
    pub fn GiNaC_symbol_unarchiver_symbol_unarchiver_destructor(
        this: *mut GiNaC_symbol_unarchiver,
    );
}
impl GiNaC_symbol_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_symbol_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_symbol_unarchiver_symbol_unarchiver(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_symbol_unarchiver_symbol_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL26symbol_unarchiver_instanceE"]
    pub static mut GiNaC_symbol_unarchiver_instance: GiNaC_symbol_unarchiver;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_realsymbol {
    pub _base: GiNaC_symbol,
}
#[test]
fn bindgen_test_layout_GiNaC_realsymbol() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_realsymbol>(),
        88usize,
        concat!("Size of: ", stringify!(GiNaC_realsymbol))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_realsymbol>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_realsymbol))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10realsymbolC1Ev"]
    pub fn GiNaC_realsymbol_realsymbol(this: *mut GiNaC_realsymbol);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10realsymbolC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_realsymbol_realsymbol1(
        this: *mut GiNaC_realsymbol,
        initname: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC10realsymbolC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
    pub fn GiNaC_realsymbol_realsymbol2(
        this: *mut GiNaC_realsymbol,
        initname: *const std_string,
        texname: *const std_string,
    );
}
impl GiNaC_realsymbol {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_realsymbol_realsymbol(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(initname: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_realsymbol_realsymbol1(__bindgen_tmp.as_mut_ptr(), initname);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        initname: *const std_string,
        texname: *const std_string,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_realsymbol_realsymbol2(
            __bindgen_tmp.as_mut_ptr(),
            initname,
            texname,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_realsymbol_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21realsymbol_unarchiver8usecountE"]
    pub static mut GiNaC_realsymbol_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_realsymbol_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_realsymbol_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_realsymbol_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_realsymbol_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_realsymbol_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21realsymbol_unarchiver6createEv"]
    pub fn GiNaC_realsymbol_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21realsymbol_unarchiverC1Ev"]
    pub fn GiNaC_realsymbol_unarchiver_realsymbol_unarchiver(
        this: *mut GiNaC_realsymbol_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC21realsymbol_unarchiverD1Ev"]
    pub fn GiNaC_realsymbol_unarchiver_realsymbol_unarchiver_destructor(
        this: *mut GiNaC_realsymbol_unarchiver,
    );
}
impl GiNaC_realsymbol_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_realsymbol_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_realsymbol_unarchiver_realsymbol_unarchiver(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_realsymbol_unarchiver_realsymbol_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL30realsymbol_unarchiver_instanceE"]
    pub static mut GiNaC_realsymbol_unarchiver_instance:
        GiNaC_realsymbol_unarchiver;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_possymbol {
    pub _base: GiNaC_realsymbol,
}
#[test]
fn bindgen_test_layout_GiNaC_possymbol() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_possymbol>(),
        88usize,
        concat!("Size of: ", stringify!(GiNaC_possymbol))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_possymbol>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_possymbol))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9possymbolC1Ev"]
    pub fn GiNaC_possymbol_possymbol(this: *mut GiNaC_possymbol);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9possymbolC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
    pub fn GiNaC_possymbol_possymbol1(
        this: *mut GiNaC_possymbol,
        initname: *const std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC9possymbolC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
    pub fn GiNaC_possymbol_possymbol2(
        this: *mut GiNaC_possymbol,
        initname: *const std_string,
        texname: *const std_string,
    );
}
impl GiNaC_possymbol {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_possymbol_possymbol(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(initname: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_possymbol_possymbol1(__bindgen_tmp.as_mut_ptr(), initname);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        initname: *const std_string,
        texname: *const std_string,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_possymbol_possymbol2(
            __bindgen_tmp.as_mut_ptr(),
            initname,
            texname,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_possymbol_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC20possymbol_unarchiver8usecountE"]
    pub static mut GiNaC_possymbol_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_possymbol_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_possymbol_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_possymbol_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_possymbol_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_possymbol_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC20possymbol_unarchiver6createEv"]
    pub fn GiNaC_possymbol_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC20possymbol_unarchiverC1Ev"]
    pub fn GiNaC_possymbol_unarchiver_possymbol_unarchiver(
        this: *mut GiNaC_possymbol_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC20possymbol_unarchiverD1Ev"]
    pub fn GiNaC_possymbol_unarchiver_possymbol_unarchiver_destructor(
        this: *mut GiNaC_possymbol_unarchiver,
    );
}
impl GiNaC_possymbol_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_possymbol_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_possymbol_unarchiver_possymbol_unarchiver(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_possymbol_unarchiver_possymbol_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL29possymbol_unarchiver_instanceE"]
    pub static mut GiNaC_possymbol_unarchiver_instance:
        GiNaC_possymbol_unarchiver;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_expair {
    pub rest: GiNaC_ex,
    pub coeff: GiNaC_ex,
}
#[test]
fn bindgen_test_layout_GiNaC_expair() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_expair>(),
        16usize,
        concat!("Size of: ", stringify!(GiNaC_expair))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_expair>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_expair))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_expair>())).rest as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_expair),
            "::",
            stringify!(rest)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_expair>())).coeff as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_expair),
            "::",
            stringify!(coeff)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6expair5printERSo"]
    pub fn GiNaC_expair_print(this: *const GiNaC_expair, os: *mut std_ostream);
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC6expair9conjugateEv"]
    pub fn GiNaC_expair_conjugate(this: *const GiNaC_expair) -> GiNaC_expair;
}
impl GiNaC_expair {
    #[inline]
    pub unsafe fn print(&self, os: *mut std_ostream) {
        GiNaC_expair_print(self, os)
    }
    #[inline]
    pub unsafe fn conjugate(&self) -> GiNaC_expair {
        GiNaC_expair_conjugate(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_expair_is_less {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_expair_is_less() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_expair_is_less>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_expair_is_less))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_expair_is_less>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_expair_is_less))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_expair_rest_is_less {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_expair_rest_is_less() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_expair_rest_is_less>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_expair_rest_is_less))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_expair_rest_is_less>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_expair_rest_is_less))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GiNaC_expair_swap {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_GiNaC_expair_swap() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_expair_swap>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_expair_swap))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_expair_swap>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_expair_swap))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_wildcard {
    pub _base: GiNaC_basic,
    pub label: ::std::os::raw::c_uint,
}
#[repr(C)]
pub struct GiNaC_wildcard_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_wildcard_visitor {
    pub vtable_: *const GiNaC_wildcard_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_wildcard_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_wildcard_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_wildcard_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_wildcard_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_wildcard_visitor))
    );
}
pub type GiNaC_wildcard_inherited = GiNaC_basic;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8wildcard8reg_infoE"]
    pub static mut GiNaC_wildcard_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_wildcard() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_wildcard>(),
        24usize,
        concat!("Size of: ", stringify!(GiNaC_wildcard))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_wildcard>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_wildcard))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_wildcard>())).label as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_wildcard),
            "::",
            stringify!(label)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_wildcard_do_print(
        this: *const GiNaC_wildcard,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard13do_print_treeERKNS_10print_treeEj"]
    pub fn GiNaC_wildcard_do_print_tree(
        this: *const GiNaC_wildcard,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard20do_print_python_reprERKNS_17print_python_reprEj"]
    pub fn GiNaC_wildcard_do_print_python_repr(
        this: *const GiNaC_wildcard,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8wildcardC1Ev"]
    pub fn GiNaC_wildcard_wildcard(this: *mut GiNaC_wildcard);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8wildcardC1Ej"]
    pub fn GiNaC_wildcard_wildcard1(
        this: *mut GiNaC_wildcard,
        label: ::std::os::raw::c_uint,
    );
}
impl GiNaC_wildcard {
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_wildcard_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_tree(
        &self,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_wildcard_do_print_tree(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_python_repr(
        &self,
        c: *const GiNaC_print_python_repr,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_wildcard_do_print_python_repr(self, c, level)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_wildcard_wildcard(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(label: ::std::os::raw::c_uint) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_wildcard_wildcard1(__bindgen_tmp.as_mut_ptr(), label);
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard17compare_same_typeERKNS_5basicE"]
    pub fn GiNaC_wildcard_compare_same_type(
        this: *mut ::std::os::raw::c_void,
        other: *const GiNaC_basic,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard5matchERKNS_2exERSt3mapIS1_S1_NS_10ex_is_lessESaISt4pairIS2_S1_EEE"]
    pub fn GiNaC_wildcard_match(
        this: *mut ::std::os::raw::c_void,
        pattern: *const GiNaC_ex,
        repl_lst: *mut GiNaC_exmap,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard7archiveERNS_12archive_nodeE"]
    pub fn GiNaC_wildcard_archive(
        this: *mut ::std::os::raw::c_void,
        n: *mut GiNaC_archive_node,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC8wildcard12read_archiveERKNS_12archive_nodeERNS_9containerINSt7__cxx114listEEE"]
    pub fn GiNaC_wildcard_read_archive(
        this: *mut ::std::os::raw::c_void,
        n: *const GiNaC_archive_node,
        syms: *mut GiNaC_lst,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC8wildcard8calchashEv"]
    pub fn GiNaC_wildcard_calchash(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_wildcard_unarchiver {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19wildcard_unarchiver8usecountE"]
    pub static mut GiNaC_wildcard_unarchiver_usecount: ::std::os::raw::c_int;
}
#[test]
fn bindgen_test_layout_GiNaC_wildcard_unarchiver() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_wildcard_unarchiver>(),
        1usize,
        concat!("Size of: ", stringify!(GiNaC_wildcard_unarchiver))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_wildcard_unarchiver>(),
        1usize,
        concat!("Alignment of ", stringify!(GiNaC_wildcard_unarchiver))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19wildcard_unarchiver6createEv"]
    pub fn GiNaC_wildcard_unarchiver_create() -> *mut GiNaC_basic;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19wildcard_unarchiverC1Ev"]
    pub fn GiNaC_wildcard_unarchiver_wildcard_unarchiver(
        this: *mut GiNaC_wildcard_unarchiver,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC19wildcard_unarchiverD1Ev"]
    pub fn GiNaC_wildcard_unarchiver_wildcard_unarchiver_destructor(
        this: *mut GiNaC_wildcard_unarchiver,
    );
}
impl GiNaC_wildcard_unarchiver {
    #[inline]
    pub unsafe fn create() -> *mut GiNaC_basic {
        GiNaC_wildcard_unarchiver_create()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        GiNaC_wildcard_unarchiver_wildcard_unarchiver(
            __bindgen_tmp.as_mut_ptr(),
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        GiNaC_wildcard_unarchiver_wildcard_unarchiver_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaCL28wildcard_unarchiver_instanceE"]
    pub static mut GiNaC_wildcard_unarchiver_instance:
        GiNaC_wildcard_unarchiver;
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7haswildERKNS_2exE"]
    pub fn GiNaC_haswild(x: *const GiNaC_ex) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_indexed {
    pub _base: GiNaC_exprseq,
    pub symtree: GiNaC_ex,
}
#[repr(C)]
pub struct GiNaC_indexed_visitor__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct GiNaC_indexed_visitor {
    pub vtable_: *const GiNaC_indexed_visitor__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_GiNaC_indexed_visitor() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_indexed_visitor>(),
        8usize,
        concat!("Size of: ", stringify!(GiNaC_indexed_visitor))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_indexed_visitor>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_indexed_visitor))
    );
}
pub type GiNaC_indexed_inherited = GiNaC_exprseq;
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexed8reg_infoE"]
    pub static mut GiNaC_indexed_reg_info: GiNaC_registered_class_info;
}
#[test]
fn bindgen_test_layout_GiNaC_indexed() {
    assert_eq!(
        ::std::mem::size_of::<GiNaC_indexed>(),
        56usize,
        concat!("Size of: ", stringify!(GiNaC_indexed))
    );
    assert_eq!(
        ::std::mem::align_of::<GiNaC_indexed>(),
        8usize,
        concat!("Alignment of ", stringify!(GiNaC_indexed))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<GiNaC_indexed>())).symtree as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GiNaC_indexed),
            "::",
            stringify!(symtree)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed20all_index_values_areEj"]
    pub fn GiNaC_indexed_all_index_values_are(
        this: *const GiNaC_indexed,
        inf: ::std::os::raw::c_uint,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed11get_indicesEv"]
    pub fn GiNaC_indexed_get_indices(
        this: *const GiNaC_indexed,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed17get_dummy_indicesEv"]
    pub fn GiNaC_indexed_get_dummy_indices(
        this: *const GiNaC_indexed,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed17get_dummy_indicesERKS0_"]
    pub fn GiNaC_indexed_get_dummy_indices1(
        this: *const GiNaC_indexed,
        other: *const GiNaC_indexed,
    ) -> GiNaC_exvector;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed19has_dummy_index_forERKNS_2exE"]
    pub fn GiNaC_indexed_has_dummy_index_for(
        this: *const GiNaC_indexed,
        i: *const GiNaC_ex,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed12printindicesERKNS_13print_contextEj"]
    pub fn GiNaC_indexed_printindices(
        this: *const GiNaC_indexed,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed13print_indexedERKNS_13print_contextEPKcS5_j"]
    pub fn GiNaC_indexed_print_indexed(
        this: *const GiNaC_indexed,
        c: *const GiNaC_print_context,
        openbrace: *const ::std::os::raw::c_char,
        closebrace: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed8do_printERKNS_13print_contextEj"]
    pub fn GiNaC_indexed_do_print(
        this: *const GiNaC_indexed,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed14do_print_latexERKNS_11print_latexEj"]
    pub fn GiNaC_indexed_do_print_latex(
        this: *const GiNaC_indexed,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed13do_print_treeERKNS_10print_treeEj"]
    pub fn GiNaC_indexed_do_print_tree(
        this: *const GiNaC_indexed,
        c: *const GiNaC_print_tree,
        level: ::std::os::raw::c_uint,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK5GiNaC7indexed8validateEv"]
    pub fn GiNaC_indexed_validate(this: *const GiNaC_indexed);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1Ev"]
    pub fn GiNaC_indexed_indexed(this: *mut GiNaC_indexed);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exE"]
    pub fn GiNaC_indexed_indexed1(this: *mut GiNaC_indexed, b: *const GiNaC_ex);
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exES3_"]
    pub fn GiNaC_indexed_indexed2(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        i1: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exES3_S3_"]
    pub fn GiNaC_indexed_indexed3(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        i1: *const GiNaC_ex,
        i2: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exES3_S3_S3_"]
    pub fn GiNaC_indexed_indexed4(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        i1: *const GiNaC_ex,
        i2: *const GiNaC_ex,
        i3: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exES3_S3_S3_S3_"]
    pub fn GiNaC_indexed_indexed5(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        i1: *const GiNaC_ex,
        i2: *const GiNaC_ex,
        i3: *const GiNaC_ex,
        i4: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exERKNS_8symmetryES3_S3_"]
    pub fn GiNaC_indexed_indexed6(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        symm: *const GiNaC_symmetry,
        i1: *const GiNaC_ex,
        i2: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exERKNS_8symmetryES3_S3_S3_"]
    pub fn GiNaC_indexed_indexed7(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        symm: *const GiNaC_symmetry,
        i1: *const GiNaC_ex,
        i2: *const GiNaC_ex,
        i3: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exERKNS_8symmetryES3_S3_S3_S3_"]
    pub fn GiNaC_indexed_indexed8(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        symm: *const GiNaC_symmetry,
        i1: *const GiNaC_ex,
        i2: *const GiNaC_ex,
        i3: *const GiNaC_ex,
        i4: *const GiNaC_ex,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exERKSt6vectorIS1_SaIS1_EE"]
    pub fn GiNaC_indexed_indexed9(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        iv: *const GiNaC_exvector,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_2exERKNS_8symmetryERKSt6vectorIS1_SaIS1_EE"]
    pub fn GiNaC_indexed_indexed10(
        this: *mut GiNaC_indexed,
        b: *const GiNaC_ex,
        symm: *const GiNaC_symmetry,
        iv: *const GiNaC_exvector,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_8symmetryERKNS_9containerISt6vectorEE"]
    pub fn GiNaC_indexed_indexed11(
        this: *mut GiNaC_indexed,
        symm: *const GiNaC_symmetry,
        es: *const GiNaC_exprseq,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_8symmetryERKSt6vectorINS_2exESaIS5_EE"]
    pub fn GiNaC_indexed_indexed12(
        this: *mut GiNaC_indexed,
        symm: *const GiNaC_symmetry,
        v: *const GiNaC_exvector,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN5GiNaC7indexedC1ERKNS_8symmetryEOSt6vectorINS_2exESaIS5_EE"]
    pub fn GiNaC_indexed_indexed13(
        this: *mut GiNaC_indexed,
        symm: *const GiNaC_symmetry,
        v: *mut GiNaC_exvector,
    );
}
impl GiNaC_indexed {
    #[inline]
    pub unsafe fn all_index_values_are(
        &self,
        inf: ::std::os::raw::c_uint,
    ) -> bool {
        GiNaC_indexed_all_index_values_are(self, inf)
    }
    #[inline]
    pub unsafe fn get_indices(&self) -> GiNaC_exvector {
        GiNaC_indexed_get_indices(self)
    }
    #[inline]
    pub unsafe fn get_dummy_indices(&self) -> GiNaC_exvector {
        GiNaC_indexed_get_dummy_indices(self)
    }
    #[inline]
    pub unsafe fn get_dummy_indices1(
        &self,
        other: *const GiNaC_indexed,
    ) -> GiNaC_exvector {
        GiNaC_indexed_get_dummy_indices1(self, other)
    }
    #[inline]
    pub unsafe fn has_dummy_index_for(&self, i: *const GiNaC_ex) -> bool {
        GiNaC_indexed_has_dummy_index_for(self, i)
    }
    #[inline]
    pub unsafe fn printindices(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_indexed_printindices(self, c, level)
    }
    #[inline]
    pub unsafe fn print_indexed(
        &self,
        c: *const GiNaC_print_context,
        openbrace: *const ::std::os::raw::c_char,
        closebrace: *const ::std::os::raw::c_char,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_indexed_print_indexed(self, c, openbrace, closebrace, level)
    }
    #[inline]
    pub unsafe fn do_print(
        &self,
        c: *const GiNaC_print_context,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_indexed_do_print(self, c, level)
    }
    #[inline]
    pub unsafe fn do_print_latex(
        &self,
        c: *const GiNaC_print_latex,
        level: ::std::os::raw::c_uint,
    ) {
        GiNaC_indexed_do_print_latex(self, c, level)
