/* automatically generated by rust-bindgen */


#![allow(dead_code, non_snake_case, non_camel_case_types, non_upper_case_globals)]


#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct LittleArray {
    pub a: [::std::os::raw::c_int; 32usize],
}
#[test]
fn bindgen_test_layout_LittleArray() {
    assert_eq!(::std::mem::size_of::<LittleArray>() , 128usize , concat ! (
               "Size of: " , stringify ! ( LittleArray ) ));
    assert_eq! (::std::mem::align_of::<LittleArray>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( LittleArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const LittleArray ) ) . a as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( LittleArray ) , "::" ,
                stringify ! ( a ) ));
}
impl Clone for LittleArray {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct BigArray {
    pub a: [::std::os::raw::c_int; 33usize],
}
#[test]
fn bindgen_test_layout_BigArray() {
    assert_eq!(::std::mem::size_of::<BigArray>() , 132usize , concat ! (
               "Size of: " , stringify ! ( BigArray ) ));
    assert_eq! (::std::mem::align_of::<BigArray>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( BigArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const BigArray ) ) . a as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( BigArray ) , "::" ,
                stringify ! ( a ) ));
}
impl Clone for BigArray {
    fn clone(&self) -> Self { *self }
}
impl Default for BigArray {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
#[repr(C)]
#[derive(Debug, Default, Copy)]
pub struct WithLittleArray {
    pub a: LittleArray,
}
#[test]
fn bindgen_test_layout_WithLittleArray() {
    assert_eq!(::std::mem::size_of::<WithLittleArray>() , 128usize , concat !
               ( "Size of: " , stringify ! ( WithLittleArray ) ));
    assert_eq! (::std::mem::align_of::<WithLittleArray>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( WithLittleArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const WithLittleArray ) ) . a as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( WithLittleArray ) ,
                "::" , stringify ! ( a ) ));
}
impl Clone for WithLittleArray {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct WithBigArray {
    pub a: BigArray,
}
#[test]
fn bindgen_test_layout_WithBigArray() {
    assert_eq!(::std::mem::size_of::<WithBigArray>() , 132usize , concat ! (
               "Size of: " , stringify ! ( WithBigArray ) ));
    assert_eq! (::std::mem::align_of::<WithBigArray>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( WithBigArray ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const WithBigArray ) ) . a as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( WithBigArray ) , "::" ,
                stringify ! ( a ) ));
}
impl Clone for WithBigArray {
    fn clone(&self) -> Self { *self }
}
impl Default for WithBigArray {
    fn default() -> Self { unsafe { ::std::mem::zeroed() } }
}
