/* automatically generated by rust-bindgen 0.59.2 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
#[repr(C)]
#[derive(Debug)]
pub struct NonCopyType {
    pub foo: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NonCopyType() {
    assert_eq!(
        ::std::mem::size_of::<NonCopyType>(),
        4usize,
        concat!("Size of: ", stringify!(NonCopyType))
    );
    assert_eq!(
        ::std::mem::align_of::<NonCopyType>(),
        4usize,
        concat!("Alignment of ", stringify!(NonCopyType))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<NonCopyType>())).foo as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NonCopyType),
            "::",
            stringify!(foo)
        )
    );
}
#[repr(C)]
pub struct WithBindgenGeneratedWrapper {
    pub non_copy_type: __BindgenUnionField<NonCopyType>,
    pub bar: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_WithBindgenGeneratedWrapper() {
    assert_eq!(
        ::std::mem::size_of::<WithBindgenGeneratedWrapper>(),
        4usize,
        concat!("Size of: ", stringify!(WithBindgenGeneratedWrapper))
    );
    assert_eq!(
        ::std::mem::align_of::<WithBindgenGeneratedWrapper>(),
        4usize,
        concat!("Alignment of ", stringify!(WithBindgenGeneratedWrapper))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<WithBindgenGeneratedWrapper>()))
                .non_copy_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WithBindgenGeneratedWrapper),
            "::",
            stringify!(non_copy_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<WithBindgenGeneratedWrapper>())).bar
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WithBindgenGeneratedWrapper),
            "::",
            stringify!(bar)
        )
    );
}
#[repr(C)]
pub union WithManuallyDrop {
    pub non_copy_type: ::std::mem::ManuallyDrop<NonCopyType>,
    pub bar: ::std::mem::ManuallyDrop<::std::os::raw::c_int>,
}
#[test]
fn bindgen_test_layout_WithManuallyDrop() {
    assert_eq!(
        ::std::mem::size_of::<WithManuallyDrop>(),
        4usize,
        concat!("Size of: ", stringify!(WithManuallyDrop))
    );
    assert_eq!(
        ::std::mem::align_of::<WithManuallyDrop>(),
        4usize,
        concat!("Alignment of ", stringify!(WithManuallyDrop))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<WithManuallyDrop>())).non_copy_type
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WithManuallyDrop),
            "::",
            stringify!(non_copy_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<WithManuallyDrop>())).bar as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WithManuallyDrop),
            "::",
            stringify!(bar)
        )
    );
}
#[repr(C)]
pub struct WithDefaultWrapper {
    pub non_copy_type: __BindgenUnionField<NonCopyType>,
    pub bar: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_WithDefaultWrapper() {
    assert_eq!(
        ::std::mem::size_of::<WithDefaultWrapper>(),
        4usize,
        concat!("Size of: ", stringify!(WithDefaultWrapper))
    );
    assert_eq!(
        ::std::mem::align_of::<WithDefaultWrapper>(),
        4usize,
        concat!("Alignment of ", stringify!(WithDefaultWrapper))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<WithDefaultWrapper>())).non_copy_type
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WithDefaultWrapper),
            "::",
            stringify!(non_copy_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<WithDefaultWrapper>())).bar as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WithDefaultWrapper),
            "::",
            stringify!(bar)
        )
    );
}
